[
    {
        "Date": "2020",
        "Event": "Armenia and Azerbaijan engaged in a six-week war over the Nagorno-Karabakh region, ending with a Russian-brokered ceasefire.",
        "Contextual_Annotation": "This reference provides context for the ongoing hostilities, highlighting the region's history of conflict and the role of external actors in maintaining peace.",
        "Article": "bon7mzog28fpzkqk"
    },
    {
        "Date": "2020",
        "Event": "Azerbaijan regained control of significant portions of its territory in Nagorno-Karabakh and the neighboring regions, marking a shift in the power balance.",
        "Contextual_Annotation": "This event adds context to the ongoing conflict by illustrating the outcome of the previous war and the subsequent territorial changes.",
        "Article": "bon7mzog28fpzkqk"
    },
    {
        "Date": "2020-09-27",
        "Event": "The Second Karabakh War began with Azerbaijan launching a large-scale offensive against the self-proclaimed Republic of Artsakh (Nagorno-Karabakh). The war lasted six weeks, resulting in Azerbaijan regaining control of large swaths of territory.",
        "Contextual_Annotation": "The Second Karabakh War was a continuation of the long-standing conflict between Azerbaijan and Armenia over the disputed Nagorno-Karabakh region. The war began with Azerbaijan launching a large-scale offensive on September 27, 2020, and ended with a tripartite ceasefire agreement on November 10, 2020.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2020-11-10",
        "Event": "A tripartite ceasefire agreement was signed between Armenia, Azerbaijan, and Russia, ending the 2020 Nagorno-Karabakh war. The agreement stipulated that Armenia would return all territories surrounding Nagorno-Karabakh to Azerbaijan, while Russian peacekeepers would be deployed to monitor the ceasefire.",
        "Contextual_Annotation": "The tripartite ceasefire agreement was brokered by Russia and brought an end to the six-week war. The agreement stipulated that Armenia would return all territories surrounding Nagorno-Karabakh to Azerbaijan, while Russian peacekeepers would be deployed to monitor the ceasefire.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-03-24",
        "Event": "Azerbaijan launched a military operation in Nagorno-Karabakh, seeking to regain full control of the disputed territory.",
        "Contextual_Annotation": "Caucasus experts said the push aimed to capitalize on what they saw as Azerbaijan’s advantage following its decisive victory in the 2020 war over Nagorno-Karabakh. In that six-week war, Azerbaijan reclaimed control over swaths of territory that had been held by ethnic Armenian forces for decades.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-03-27",
        "Event": "Russia deployed peacekeepers to Nagorno-Karabakh to monitor the ceasefire that was agreed to between Armenia and Azerbaijan.",
        "Contextual_Annotation": "Russia’s foreign minister, Sergey V. Lavrov, said in a statement on Sunday that the deployment was part of a broader effort by Moscow to “promote a comprehensive settlement” of the conflict in Nagorno-Karabakh.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-08",
        "Event": "Prime Minister Nikol Pashinyan accused Azerbaijan of building up military forces along the border of Nagorno-Karabakh, a region internationally recognized as part of Azerbaijan but controlled by ethnic Armenians.",
        "Contextual_Annotation": "These allegations raised concerns about the potential for a renewed outbreak of hostilities between the two countries.",
        "Article": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-08",
        "Event": "Azerbaijan’s foreign ministry denied the claims and instead called out Armenia for military and political provocations.",
        "Contextual_Annotation": "Azerbaijan consistently rejected accusations of military build-up and maintained that its troop movements were part of regular drills.",
        "Article": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-08",
        "Event": "Russia, a key player in the region, stated that it would continue to play its role in maintaining peace and stability in the South Caucasus region even with Armenia's decision to host a joint exercise with the US.",
        "Contextual_Annotation": "Russia's continued involvement in peacekeeping efforts highlights its significant influence in the resolution",
        "Article": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-12",
        "Event": "Azerbaijan and Armenia agreed to a third ceasefire, brokered by Russia.",
        "Contextual_Annotation": "The agreement, which was signed by the foreign ministers of Armenia and Azerbaijan in Moscow, called for a “complete cessation of hostilities” and the creation of a humanitarian corridor to allow civilians to evacuate.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-19",
        "Event": "Ethnic Armenian separatist authorities reported a significant upsurge in fighting in the Nagorno-Karabakh region of Azerbaijan, resulting from an offensive launched by Azerbaijan. The conflict, marked by artillery and drone strikes, aimed to penetrate deep into the territory.",
        "Contextual_Annotation": "The flare-up raised alarms of a wider conflict, as it suggested a potential failure of the ceasefire.",
        "Article": "bon7mzog28fpzkqk"
    },
    {
        "Date": "2023-09-20",
        "Event": "Azerbaijan regained control of Nagorno-Karabakh after a three-decade-long Armenian occupation. Azerbaijan's President Ilham Aliyev ordered his military to protect the Armenian population in the region.",
        "Contextual_Annotation": "Azerbaijan's victory in the Second Karabakh War marked a significant shift in the balance of power in the region. Azerbaijan regained control of Nagorno-Karabakh, which had been under Armenian occupation since the early 1990s. The victory was a major blow to Armenia and raised concerns about the potential for further ethnic tensions in the region.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-09-21",
        "Event": "Armenian Prime Minister Nikol Pashinyan urged peace after Azerbaijan retook Karabakh. Azerbaijan's President Ilham Aliyev expressed willingness for wider peace negotiations with Armenia.",
        "Contextual_Annotation": "Context: These statements indicated a desire from both sides to reduce tensions and find a peaceful resolution to the conflict. Pashinyan recognized the critical need for peace to ensure Armenia's independence and sovereignty. Aliyev's willingness for wider peace negotiations hinted at potential progress towards a comprehensive settlement between the two nations.",
        "Article": "9owr18ngmcvsob4x"
    },
    {
        "Date": "2023-09-24",
        "Event": "The International Committee of the Red Cross (ICRC) delivered nearly 70 metric tonnes of humanitarian supplies to Nagorno-Karabakh.",
        "Contextual_Annotation": "The supplies included wheat flour, salt, and sunflower oil. The ICRC also carried out the medical evacuation of 17 people wounded during the fighting.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-24",
        "Event": "The ethnic Armenian leadership of breakaway Nagorno-Karabakh said the terms of the ceasefire with Azerbaijan were being implemented.",
        "Contextual_Annotation": "The statement from the Karabakh Armenians said work was proceeding on the delivery of humanitarian aid and evacuation of the wounded. It also referred to “political consultations” on the future of the region, which they call Artsakh, and its 120,000 Armenian residents.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-25",
        "Event": "US Senator Gary Peters visited the Armenia-Azerbaijan border and called for international observers and transparency from Azerbaijan.",
        "Contextual_Annotation": "Mr Peters said the situation in Karabakh required international observers and transparency from Azerbaijan. “We’ve heard from the Azerbaijani government that there’s... nothing to worry about, but if that’s the case then we should allow international observers in to see,” Mr Peters said.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-27",
        "Event": "Azerbaijan vowed to prosecute the separatist leadership of Nagorno-Karabakh.",
        "Contextual_Annotation": "Following the end of the war, Azerbaijan vowed to prosecute the separatist leadership of Nagorno-Karabakh. The separatist leaders were accused of war crimes and other atrocities. The vow to prosecute the separatist leadership indicated that Azerbaijan was determined to hold those responsible for the war accountable.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-09-27",
        "Event": "Russia delivered more than 50 tonnes of food and other aid to Nagorno-Karabakh.",
        "Contextual_Annotation": "The aid was delivered to the capital of Nagorno-Karabakh, Stepanakert.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-28",
        "Event": "Azerbaijan said its main task was ensuring the safety of the Armenian civilian population and that it was providing them with tents, hot food, and medical assistance.",
        "Contextual_Annotation": "Azerbaijan’s interior ministry said it was also working on issuing documents to the Armenian population, such as passports.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-10-04",
        "Event": "Four ex-leaders of Nagorno-Karabakh were detained by Azerbaijan's State Security Service.",
        "Contextual_Annotation": "The detention of four ex-leaders of Nagorno-Karabakh by Azerbaijan's State Security Service was a significant development in the aftermath of the war. The detention of the ex-leaders indicated that Azerbaijan was taking steps to consolidate its control over the region and to hold those responsible for the war accountable.",
        "Article": "96moyhcopwdgflfi"
    }
]