{
    "2020-09-27": {
        "Event": [
            "Azerbaijan launched a large-scale offensive against the self-proclaimed Republic of Artsakh (Nagorno-Karabakh), which resulted in a six-week war."
        ],
        "Contextual_Annotation": [
            "The Second Karabakh War began, with Azerbaijan retaking control of several territories in Nagorno-Karabakh. Azerbaijan regained control of swathes of territory in Nagorno-Karabakh and surrounding regions."
        ],
        "Article_id": [
            "96moyhcopwdgflfi"
        ]
    },
    "2020-11-10": {
        "Event": [
            "A tripartite ceasefire agreement was signed between Armenia, Azerbaijan, and Russia, ending the 2020 Nagorno-Karabakh war."
        ],
        "Contextual_Annotation": [
            "A ceasefire was signed between Armenia and Azerbaijan, with Nagorno-Karabakh being returned to Azerbaijani control."
        ],
        "Article_id": [
            "96moyhcopwdgflfi"
        ]
    },
    "2022-03-24": {
        "Event": [
            "Azerbaijan accuses Armenia of violating the ceasefire, sparking tensions between the two countries."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2022-08-03": {
        "Event": [
            "Clashes erupt between Armenian and Azerbaijani forces along the border, resulting in several casualties."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-03-24": {
        "Event": [
            "Azerbaijan launches a military operation in Nagorno-Karabakh, seeking to regain control of the disputed territory."
        ],
        "Contextual_Annotation": [
            "Armenia and Azerbaijan agree to a ceasefire, but fighting continues sporadically."
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-03-27": {
        "Event": [
            "Russia deploys peacekeepers to Nagorno-Karabakh to monitor the ceasefire."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-07-20": {
        "Event": [
            "Azerbaijan announces the capture of several villages in Nagorno-Karabakh."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-08-03": {
        "Event": [
            "Azerbaijan launches a new offensive in Nagorno-Karabakh."
        ],
        "Contextual_Annotation": [
            "Azerbaijan and Armenia agree to a new ceasefire, but it is violated within hours."
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-09-08": {
        "Event": [
            "Armenia accuses Azerbaijan of conducting a military build-up along the border of Nagorno-Karabakh and the Armenia-Azerbaijan border.",
            "Russia criticizes Armenia's decision to host a joint exercise involving 85 US soldiers, stating that it does not contribute to stabilizing the situation in the region."
        ],
        "Contextual_Annotation": [
            "Azerbaijan’s foreign ministry rejects Armenia's assertion and accuses Yerevan of conducting military and political provocations.",
            null
        ],
        "Article_id": [
            "x6bs26mxih4wjnvb",
            "x6bs26mxih4wjnvb"
        ]
    },
    "2023-09-11": {
        "Event": [
            "Separatists in Karabakh refused to accept the cargo of a Russian Red Cross truck carrying aid, despite a deal announced with ethnic Armenian separatists to open the route for the first time in decades."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "j40zdfvo5mm8yv3c"
        ]
    },
    "2023-09-12": {
        "Event": [
            "A Russian truck carrying food aid for Armenians in the Karabakh city of Khankendi set off via the Aghdam road, according to a Reuters witness and local media.",
            "Azerbaijan and Armenia agree to a third ceasefire, which is implemented with the support of Russia."
        ],
        "Contextual_Annotation": [
            null,
            null
        ],
        "Article_id": [
            "j40zdfvo5mm8yv3c",
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-09-19": {
        "Event": [
            "Ethnic Armenian separatist authorities reported a major escalation of hostilities in Azerbaijan's Nagorno-Karabakh region."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "bon7mzog28fpzkqk"
        ]
    },
    "2023-09-20": {
        "Event": [
            "Azerbaijan regained control of Nagorno-Karabakh after a three-decade-long Armenian occupation.",
            "Several hundred protesters gathered in the Armenian capital to demand that the government do more to support ethnic Armenians in Nagorno-Karabakh."
        ],
        "Contextual_Annotation": [
            "Thousands of Armenians gathered at the airport in Stepanakert, Nagorno-Karabakh, following a ceasefire agreement that would result in the surrender of separatist forces to Azerbaijan.",
            null
        ],
        "Article_id": [
            "8pjpbua9arko3ovu",
            "vehvbiu65a6u2ryr"
        ]
    },
    "2023-09-21": {
        "Event": [
            "Armenian Prime Minister Nikol Pashinyan urges peace after Azerbaijan retakes Karabakh."
        ],
        "Contextual_Annotation": [
            "Azerbaijan's President Ilham Aliyev expresses willingness for wider peace negotiations with Armenia."
        ],
        "Article_id": [
            "9owr18ngmcvsob4x"
        ]
    },
    "2023-09-24": {
        "Event": [
            "The ethnic Armenian leadership of breakaway Nagorno-Karabakh says the terms of the ceasefire with Azerbaijan are being implemented, with work proceeding on the delivery of humanitarian aid and evacuation of the wounded."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "m5vcc0dfsmuho41p"
        ]
    },
    "2023-09-25": {
        "Event": [
            "Petya Grigoryan, a 69-year-old driver, fled his village in the Martakert district of Karabakh after it was heavily bombed by Azerbaijani armed forces."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "kgiisc7nhbtx8o7o"
        ]
    },
    "2023-09-27": {
        "Event": [
            "Azerbaijan vowed to prosecute the separatist leadership of Nagorno-Karabakh."
        ],
        "Contextual_Annotation": [
            null
        ],
        "Article_id": [
            "96moyhcopwdgflfi"
        ]
    },
    "2023-10-04": {
        "Event": [
            "Four ex-leaders of Nagorno-Karabakh were detained by Azerbaijan's State Security Service and taken to Baku."
        ],
        "Contextual_Annotation": [
            "Three other former leaders of Nagorno-Karabakh arrived safely in Armenia."
        ],
        "Article_id": [
            "96moyhcopwdgflfi"
        ]
    }
}