[
    {
        "id": "st_1162690",
        "Title": "EU's Borrell tells Israel: 'One horror doesn’t justify another'",
        "Text": "MAGEN, Israel  -     EU foreign policy chief Josep Borrell urged Israel on Thursday not to be consumed by rage in its response to last month's Hamas attack, declaring that \"one horror does not justify another\".Borrell made his remarks on a visit to Israel, speaking alongside Israeli Foreign Minister Eli Cohen after the two men had visited Kibbutz Be'eri, a focal point of the Oct. 7 assault.\"I understand your rage but let me ask you not to be consumed by rage. I think that's what the best friends of Israel can tell you,\" he said.Speaking at a regional council building a short drive from the kibbutz, Borrell stressed the EU's solidarity with Israel and its support for the country's right to defend itself in line with international law.\"But one thing is to defend Israel and another thing's to take care of the people in need,\" he added.\"And that is why the European Union, together with supporting the right to defend to Israel, is also asking for humanitarian assistance, for food, water, fuel, protection (for people in Gaza),\" he said. REUTERS",
        "Date": "2023-11-16",
        "Article_URL": "https://www.straitstimes.com/asia/eus-borrell-tells-israel-one-horror-doesn-t-justify-another",
        "reranked_score": 6.524664878845215,
        "Event": "EU foreign policy chief Josep Borrell urged Israel not to be consumed by rage in its response to last month's Hamas attack",
        "Event_date": "2023-10-07"
    },
    {
        "id": "st_1155048",
        "Title": "EU leaders to hold emergency virtual summit on Israel-Hamas conflict on Tuesday  ",
        "Text": "BRUSSELS - European Council president Charles Michel said on Saturday that he had convened a video conference summit of European Union leaders on Tuesday to discuss the Hamas attacks on Israelis and Israel’s response.Mr Michel said the bloc stood in “full solidarity” with the people of Israel after the “brutal terrorist attacks” of a week ago.In an invitation letter to EU leaders, Mr Michel said Israel had the right to defend itself in compliance with international law.He said the siege of the Gaza Strip was raising alarm bells in the international community, prompting him to convene a video conference meeting on Tuesday at 5.30pm Central European Time (11.30pm Singapore time).“It is of utmost importance that the European Council, in line with the treaties and our values, sets our common position and establishes a clear unified course of action that reflects the complexity of the unfolding situation,” he wrote.Mr Michel said the EU had to be an advocate of peace and respect for international law and should seek to avoid a regional escalation of the situation.He added that the conflict had the potential to feed extremism in EU societies and could prompt migration and movements of a large number of people to neighbouring countries. REUTERS",
        "Date": "2023-10-15",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/eu-leaders-to-hold-emergency-virtual-summit-on-middle-east-on-tuesday-0",
        "reranked_score": 6.209072589874268,
        "Event": "EU leaders will hold an emergency virtual summit on the Israel-Hamas conflict",
        "Event_date": "2023-10-17"
    },
    {
        "id": "st_1163614",
        "Title": "Palestinian state best guarantee of Israel security: EU’s Borrell",
        "Text": "BRUSSELS - European Union (EU) foreign policy chief Josep Borrell said on Nov 20 that the establishment of a Palestinian state would be the best way of ensuring Israel’s security.Mr Borrell held a video meeting with foreign ministers from the EU’s 27 countries after touring the Middle East for talks on Israel’s war with Hamas.  The EU’s top diplomat said he had drawn “a fundamental political conclusion” from his discussions across the region. “I think that the best guarantee for Israel’s security is the creation of a Palestinian state,” Mr Borrell said in a written summary of the EU meeting.Mr Borrell has insisted Israel should not occupy Gaza after the current conflict ends and that control of the territory should be handed over to the Palestinian Authority.“Despite the huge challenges, we have to advance our reflections on the stabilisation of Gaza and the future Palestinian state,” he said. In the short term, Mr Borrell said, after visiting a string of Arab states, that there was a “sense of urgency” over the desperate humanitarian situation in Gaza. “The UN Security Council resolution calling for immediate humanitarian pauses is a big step forward, but we must ensure its rapid implementation,” he said. Another major fear was the possibility of the conflict further inflaming volatile situation in the West Bank and dragging in other actors in the Middle East. “In (the) light of increased extremists and settlers’ violence against Palestinians, there is a real risk that the situation could escalate,” Mr Borrell said. “Reports of a ship hijacked by the Houthis are another worrying signal of a risk of the regional spill over.” AFP",
        "Date": "2023-11-21",
        "Article_URL": "https://www.straitstimes.com/world/europe/palestinian-state-best-guarantee-of-israel-security-eus-borrell",
        "reranked_score": 5.85560941696167,
        "Event": "EU foreign policy chief Josep Borrell said that the establishment of a Palestinian state would be the best way of ensuring Israel’s security.",
        "Event_date": "2023-11-20"
    },
    {
        "id": "st_1157082",
        "Title": "EU continues talks on humanitarian ceasefire in Israel-Hamas war",
        "Text": "EU countries are still discussing the idea of a humanitarian ceasefire in the war between Israel and Hamas but there are different ways to get much-needed aid to Palestinians in Gaza, Swedish foreign minister Tobias Billstrom said on Monday.\"The discussions are ongoing, but the question really isn't about a ceasefire, but about how to bring aid forward and that can be done in very many different ways,\" he told reporters after a meeting of EU foreign ministers in Luxembourg. He said Sweden preferred a U.N. proposal for a humanitarian corridor.Earlier on Monday, EU foreign policy chief Josep Borrell voiced support for a \"humanitarian pause\" but some of the bloc's foreign ministers expressed reservations about the idea. REUTERS",
        "Date": "2023-10-23",
        "Article_URL": "https://www.straitstimes.com/asia/eu-continues-talks-on-humanitarian-ceasefire-in-israel-hamas-war",
        "reranked_score": 5.584986209869385,
        "Event": "EU countries discussed the possibility of a humanitarian ceasefire in the Israel-Hamas war",
        "Event_date": "2023-10-23"
    },
    {
        "id": "st_1153503",
        "Title": "World reacts to Israel-Hamas war",
        "Text": "PARIS – Countries around the world have reacted to a wave of attacks by land, sea and air carried out by Palestinian armed group Hamas that Israel says has claimed hundreds of lives. The statements by world leaders ranged from outright condemnation of the attacks and strong support for Israel from Western nations, to support for Hamas from some Middle Eastern countries. Many have called for a de-escalation of the conflict, after Israel launched air strikes and other military operations targeting Gaza that the Palestinian authorities say have killed hundreds.Here is a round-up of the reactions:United States President Joe Biden said US support for Israel was “rock solid and unwavering”. On Sunday, he ordered US ships and warplanes to move closer to Israel.Washington also promised to provide munitions and equipment to Israel, US Defence Secretary Lloyd Austin said in a statement on Sunday.Several US citizens were among those killed in Hamas’ surprise attack, according to a US National Security Council spokesperson.Iran President Ebrahim Raisi said on Sunday that Iran supported the Palestinians’ right to self-defence, and warned that Israel must be held accountable for endangering the region.A senior adviser to Iran’s Supreme Leader, Ayatollah Ali Khamenei, had already backed the attack last Saturday, calling it a “proud operation”.Saudi Arabia Saudi Arabia’s Foreign Ministry called for “an immediate halt to the escalation between the two sides, protection of civilians and self-control”.United Nations The United Nations Security Council held an emergency meeting on Sunday, a day after Secretary-General Antonio Guterres urged diplomatic efforts in the Middle East to prevent wider conflict.Diplomats said the Security Council did not consider any joint statement, let alone a binding resolution, with members led by Russia hoping for a broader focus than condemning Hamas.European Union European Commission president Ursula von der Leyen had already condemned the attack by Hamas last Saturday.On Sunday, she posted on X, formerly Twitter: “The full scale of the brutality of the Hamas terror attack leaves us breathless. “Defenceless people, brutally murdered in cold blood on the streets. We stand strong with Israel and its people. Today, the EU and Israeli flags fly side by side.”China “China is deeply concerned about the current escalation of tension and violence between Palestine and Israel,” a Foreign Ministry statement said on Sunday. Beijing “calls on all parties concerned to remain calm and exercise restraint, cease fire immediately, protect civilians and prevent further deterioration of the situation”, it added.Russia Russia’s Foreign Ministry called for an “immediate ceasefire” and negotiations towards “a comprehensive, lasting and long-awaited peace”, said spokeswoman Maria Zakharova. Ukraine Ukrainian President Volodymyr Zelensky, whose country is fending off a Russian invasion, said on Sunday that he had spoken with Israeli Prime Minister Benjamin Netanyahu to offer condolences “for the numerous casualties caused by the terrorist attack”.He said last Saturday that Israel had an indisputable right to defend itself, adding that “terror is always a crime”.South Africa The ruling African National Congress issued a statement on Sunday saying: “It can no longer be disputed that apartheid South Africa’s history is occupied Palestine’s reality.“As a result, the decision by Palestinians to respond to the brutality of the settler Israeli apartheid regime is unsurprising.”The statement added it was clear that “the degenerating security situation is directly linked to the unlawful Israeli occupation”.France French Foreign Minister Catherine Colonna held talks by telephone with several of her counterparts in the Middle East in a bid to “prevent the conflict degenerating” by spreading to other parts of the region, a ministry statement said on Sunday.France’s Foreign Ministry also called for the immediate release of the hostages taken by Hamas.Germany German Chancellor Olaf Scholz said on Sunday that Israel has the right to defend itself against “barbaric attacks” and “to protect its citizens and to pursue the attackers”.He called Mr Netanyahu to tell him Germany stands “firmly and unwaveringly by Israel’s side”. German-Israeli nationals are among the hostages taken by Hamas, a Foreign Ministry source confirmed.Britain British Prime Minister Rishi Sunak said on Sunday he had assured Mr Netanyahu of London’s “steadfast support”.“We will do everything that we can to help. Terrorism will not prevail,” he added in a statement.Turkey Turkish President Recep Tayyip Erdogan on Sunday urged Israel and Hamas “to support peace” and refrain from harming civilians.“There is no good in (attacking) civilians,” he said. “We are ready to do everything to reduce the tension.”Italy Italian Prime Minister Giorgia Meloni has called Mr Netanyahu to reaffirm “Rome’s full solidarity” following the Hamas offensive. “Italy stands by the Israeli people at this difficult time,” said a government statement.Japan Japan “strongly condemns” the attacks, Foreign Minister Yoko Kamikawa said on Sunday, as well as the taking of hostages by Hamas.“Meanwhile, we are seriously concerned about the large number of casualties in the Gaza Strip as a result of attacks by the Israel Defence Forces,” her statement continued, calling for restraint.Vatican City Pope Francis on Sunday said that “terrorism and war do not lead to any resolutions, but only to the death and suffering of so many innocent people.“War is a defeat! Every war is a defeat! Let us pray that there be peace in Israel and in Palestine”.India Prime Minister Narendra Modi said India stands “in solidarity with Israel at this difficult hour”. “Deeply shocked by the news of terrorist attacks in Israel,” he said.Venezuela Venezuela’s government expressed its “deep concern” over the clashes.In a statement on X, it said the fighting was “the result of the impossibility of the Palestinian people to find in multilateral international legality a space to assert their historic rights”.Yemen In Yemen, Huthi rebels who control the capital Sanaa expressed their support for “the heroic jihadist operation”. In a statement on the website of the Huthi-controlled Saba news agency, the Iran-aligned militant group said the attack “revealed the weakness, fragility and impotence” of Israel. AFP",
        "Date": "2023-10-09",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/world-reacts-to-israel-gaza-war",
        "reranked_score": 4.289892196655273,
        "Event": "Palestinian armed group Hamas launched a series of attacks on Israel by land, sea, and air, resulting in hundreds of casualties.",
        "Event_date": "2023-10-07"
    },
    {
        "id": "st_1155252",
        "Title": "While You Were Sleeping: 5 stories you might have missed, Oct 16",
        "Text": "War could widen beyond Israel and Hamas: US officialsTop US officials warned on Sunday that the war between Israel and militant group Hamas could escalate, as American warships headed to the area amid growing clashes on the country’s northern border with Lebanon.Israel has unleashed a ferocious bombing campaign over Gaza in retaliation for unprecedented attacks inside Israel by Hamas eight days ago that killed some 1,300 Israelis, mostly civilians.Gaza authorities say more than 2,670 people have been killed there, a quarter of them children. Casualties are expected to rise as Israel prepares for a ground assault on the tiny, densely populated enclave that could start within days.The conflict has sent tensions soaring. “There is a risk of an escalation of this conflict, the opening of a second front in the north and, of course, Iran’s involvement,” White House national security adviser Jake Sullivan told CBS.READ MORE HEREPoland’s pro-EU opposition set for majority: Exit pollPoland’s opposition is on track for a majority in Sunday’s election, an exit poll showed, an upset that would deny the ruling nationalists a third term and steer the country back into the European mainstream. The Civic Coalition under former European Council president Donald Tusk won 32 per cent of the vote, according to the Ipsos survey for the country’s main broadcasters.The Third Way alliance had 13 per cent, with the Left party at 8.6 per cent, giving the three groups 248 seats in the 460-strong lower house of parliament.READ MORE HEREUS House to vote Tuesday in struggle to elect speakerThe US House of Representatives, paralysed for the past two weeks amid a leadership fight among Republicans, will vote on Tuesday in its latest attempt to elect a speaker, members were told on Sunday.The blockage in the House for one of the most powerful positions in US politics – second in line to the presidency – has few precedents.Members have grown increasingly frustrated as the absence of a speaker has prevented action on key spending measures and kept the chamber from reacting to crises like the Israel-Hamas war.READ MORE HEREUnited fans seek clarity as Ratcliffe eyes minority stakeA leading Manchester United fans’ group called on Sunday for clarity on the future of the English giants amid speculation British billionaire Jim Ratcliffe is set to take a minority stake in the club.United’s owners, the American Glazer family, announced nearly a year ago that they were exploring “strategic alternatives to enhance the club’s growth”, with a full sale one of the options.Qatari banker Sheikh Jassim Bin Hamad Al Thani withdrew his attempt to buy the 20-time English champions, a source close to the bid told AFP on Saturday.READ MORE HERETaylor Swift concert film dominates at cinemasPop singer Taylor Swift ruled movie box offices over the weekend as her concert film transformed darkened theatres into dance floors and hauled in an estimated US$126 million-plus (S$170 million) around the world.Moviegoers dressed in concert T-shirts and sequins for screenings of Taylor Swift: The Eras Tour.At many showings, fans stood to sing along and move to the beat of Shake It Off, Anti-Hero and other hits from Swift’s 17-year career.READ MORE HERE",
        "Date": "2023-10-16",
        "Article_URL": "https://www.straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-oct-16-3",
        "reranked_score": 4.1644182205200195,
        "Event": "The US House of Representatives will vote on Tuesday in its latest attempt to elect a speaker.",
        "Event_date": "2023-10-17"
    },
    {
        "id": "st_1155364",
        "Title": "Iran says US already ‘militarily involved’ in Israeli-Hamas conflict",
        "Text": "DUBAI - The United States is already heavily involved in the conflict between Israel and Hamas and must be held to account, an Iranian official said on Monday.The US is bolstering its firepower in the Middle East in response to war between its ally Israel and the Iranian-backed Palestinian militants Hamas amid fears of regional spillover.Asked if Teheran would engage if the US weighed in, Foreign Ministry spokesperson Nasser Kanaani said: \"Iran considers that the United States is already militarily involved in the conflict between Israel and Palestinians.\"\"The crimes of the Zionist regime are carried out with the support of the United States and Washington must be held accountable,\" he added at a news conference. The newest US aircraft carrier - also the world's largest - is already in the eastern Mediterranean and is due to be joined by a second US aircraft carrier in coming days.US Secretary of State Antony Blinken said on Sunday the aircraft carriers are not a provocation but a deterrence. REUTERS",
        "Date": "2023-10-16",
        "Article_URL": "https://www.straitstimes.com/asia/iran-says-us-already-militarily-involved-in-israeli-palestinian-conflict",
        "reranked_score": 4.04132080078125,
        "Event": "Iran accuses the United States of being militarily involved in the Israeli-Hamas conflict.",
        "Event_date": "2023-10-16"
    },
    {
        "id": "st_1154834",
        "Title": "White House: No sign other actors to join Israel-Hamas conflict",
        "Text": "WASHINGTON  -     The White House said on Friday it has not seen any indications that other actors were considering joining and widening the ongoing conflict between Israel and Palestinian militant group Hamas.\"We haven't seen any other external actor that has indicated a willingness or readiness to widen and deepen this conflict,\" White House National Security Council spokesperson John Kirby told reporters.    The comments came hours after Hezbollah deputy chief Naim Qassem said on Friday that the group would not be swayed by calls for it to stay on the sidelines of the ongoing conflict between Israel and Hamas, saying the party was \"fully ready\" to contribute to the fighting. REUTERS",
        "Date": "2023-10-14",
        "Article_URL": "https://www.straitstimes.com/asia/white-house-no-sign-other-actors-to-join-israel-hamas-conflict",
        "reranked_score": 1.8706793785095215,
        "Event": "The White House stated that it has not seen any indications that other actors were considering joining the conflict between Israel and Hamas.",
        "Event_date": "2023-10-13"
    }
]