[
    {
        "id": "st_1155620",
        "Title": "WHO says it needs urgent access to Gaza to deliver aid, medical supplies",
        "Text": "LONDON  -     The World Health Organization said on Tuesday it needs urgent access to Gaza to deliver aid and medical supplies, as the UN agency warned of a humanitarian crisis in the Israeli-occupied Palestinian enclave.Speaking to media in a briefing, Dr Richard Brennan, regional emergency director of the WHO's Eastern Mediterranean regional office, said the WHO was meeting with \"decision-makers\" on Tuesday to open access to Gaza as soon as possible.Dr Richard Peeperkorn, WHO Representative in the occupied Palestinian territories, said 2,800 people have died and 11,000 injured in Gaza since Israeli air strikes started. About half of them were women and children. REUTERS",
        "Date": "2023-10-17",
        "Article_URL": "https://www.straitstimes.com/asia/who-says-it-needs-urgent-access-to-gaza-to-deliver-aid-medical-supplies",
        "reranked_score": 7.182124614715576,
        "Event": "The World Health Organization (WHO) requested urgent access to Gaza to deliver aid and medical supplies.",
        "Event_date": "2023-10-17"
    },
    {
        "id": "st_1160289",
        "Title": "UN bodies make united call for humanitarian ceasefire in Gaza",
        "Text": "GENEVA  -     The heads of several major United Nations bodies on Monday made a united call for a humanitarian ceasefire in Gaza as Israeli strikes intensify nearly one month into the conflict. The 18 signatories include Volker Turk, the U.N. High Commissioner for Human Rights, the head of the World Health Organization, Tedros Adhanom Ghebreyesus, and U.N. aid chief Martin Griffiths.\"An entire population is besieged and under attack, denied access to the essentials for survival, bombed in their homes, shelters, hospitals and places of worship. This is unacceptable,\" they said in a joint statement.\"We need an immediate humanitarian ceasefire. It's been 30 days. Enough is enough. This must stop now.\"Griffiths on Friday called for humanitarian \"pauses\" in Israel's bombardment of the densely populated Palestinian enclave to help aid deliveries, which are far below pre-conflict levels.Palestinian envoy to the United Nations Riyad Mansour responded that Griffiths should call for a full ceasefire.\"You should be saying clearly and loudly in line with IHL (International Humanitarian Law) that a ceasefire should take place,\" Mansour said. \"Saving lives should take place. An immediate cessation of all of these hostilities should take place. This is what I expect from you.\"Israel has rebuffed mounting international pressure for a ceasefire, saying hostages taken by Hamas militants during their rampage in southern Israel on Oct. 7 should be released. REUTERS",
        "Date": "2023-11-06",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/un-bodies-make-united-call-for-humanitarian-ceasefire-in-gaza",
        "reranked_score": 6.501074314117432,
        "Event": "The heads of several UN bodies called for a humanitarian ceasefire in Gaza.",
        "Event_date": "2023-11-06"
    },
    {
        "id": "st_1159793",
        "Title": "Japan to provide $88 million in additional humanitarian aid to Palestinians",
        "Text": "TOKYO – Japan will provide US$65 million (S$88 million) in additional humanitarian aid to Palestinians out of concern over the conflict in Gaza, Japanese Foreign Minister Yoko Kamikawa said during a tour of Israel and Jordan on Friday.Speaking to reporters in Jordan after meeting Israeli Foreign Minister Eli Cohen and Palestinian counterpart Riyad al-Maliki, Ms Kamikawa also said Japan was planning to provide material aid to war-torn Gaza.“It is necessary for Israel and Palestine to be able to coexist peacefully in order to prevent the repeat of another tragic act of terrorism,” Ms Kamikawa said, adding that she had communicated Japan’s continued support for a two-state solution to both Mr Cohen and Mr Maliki.The visit comes days before Japan is set to host the foreign ministers of the industrialised Group of Seven nations in Tokyo as the crisis in Gaza deepens, with Israel resisting calls for a humanitarian pause and the leader of Lebanon’s Iran-backed Hezbollah group warning of the conflict spilling over to neighbouring areas.Ms Kamikawa refrained from commenting on whether Israel’s strikes on Gaza were within the limits of international law, but said that actors must comply with the spirit of protecting human rights and not cause needless civilian deaths. REUTERS",
        "Date": "2023-11-04",
        "Article_URL": "https://www.straitstimes.com/asia/japan-to-provide-65-million-additional-humanitarian-aid-to-palestinians",
        "reranked_score": 6.271285057067871,
        "Event": "Japan announced an additional $88 million in humanitarian aid to Palestinians",
        "Event_date": "2023-11-03"
    },
    {
        "id": "st_1158945",
        "Title": "Palestinian Americans fundraise for Gaza, as aid groups receive record donations",
        "Text": "NEW YORK – Palestinian Americans and aid groups in the United States are raising funds for Gaza, which faces a deepening humanitarian crisis as the Israel-Hamas war enters its fourth week – but they have as yet limited ability to get supplies into the besieged enclave.Aid organisations that serve civilians in Gaza say they are receiving record amounts of donations in a sign of public support for relief efforts, even as a growing stock of supplies remains stalled at Egypt’s Rafah border crossing.In the Gaza Strip, where 2.3 million people live, civilians are in dire need of clean water, food and medicine, emergency medics say. Half of Gaza’s population was already living in poverty before the crisis.“We’ve seen a significant increase in donations, unlike (anything) we’ve ever seen before,” said Mr Steve Sosebee, president of the US-based Palestine Children’s Relief Fund, which has a staff headcount of 40 in Gaza, who provide medical support.He said the fund, which usually has an annual budget of around US$12 million (S$16.45 million), had raised US$15 million in just 10 days.However, with a web of political and logistical obstacles on getting aid in, much of the money and supplies intended for Gaza is in limbo, forcing aid groups to wait as they amass truckloads of goods.Hamas militants burst over the Gaza border and rampaged through Israeli towns on Oct 7, killing 1,400 people and taking 229 hostages, according to Israeli authorities.In response, Israel launched its most intense air bombardment campaign on the tiny enclave, along with a “total siege”, banning food, water and fuel imports.Aid groups say they are building up supplies in hopes of eventually getting them through to civilians in Gaza, nearly half of whom are children.There has been “a five-fold increase in the total number of donors versus typical past emergencies”, said Mr Derek Madsen, chief development officer of Anera, a non-partisan emergency relief group for refugees throughout the Middle East.The organisation, which maintains the privacy of individual donors, said it had recently received the largest single donation from an individual in its 55-year history.The majority of support comes from donors based in the US, he added, with individual donations averaging around US$138. The efforts mirror those of Jewish groups in the US and Canada, who also fundraised millions for Israel.Anera was using the last of its stocks this week to distribute meals and vegetable parcels in Gaza. Its staff of 12, like everyone in Gaza, were facing “unbelievable, unimaginable trauma”, he said.Glued to the televisionIn Ann Arbor, Michigan, Ms Rabia Shafie, national director of the Palestine Aid Society, said her group was speaking to student and Muslim groups on local university campuses and community centres to spread awareness and raise donations for the Red Crescent and UNRWA, the United Nations aid agency that serves Palestinian refugees.“The money is needed to help people survive at this point of time. Medical support is so essential,” she said.“People are glued to the television... watching the news moment to moment, and very stressed out over the situation,” said Ms Rabia, adding that it was difficult as a Palestinian American to watch “the massacre and injustice done to our people back home”.Hamas-governed Gaza is one of the most densely packed places on Earth, and its medical authorities say over 8,000 Palestinians have been killed since air strikes began, including more than 3,000 children.Mr Madsen called for a ceasefire and establishment of a humanitarian corridor “so that people literally do not starve to death, literally do not die of dehydration”.Last week, in Bay Ridge, Brooklyn, home to one of New York’s largest Muslim and Arab communities, hundreds of protesters called for a ceasefire with signs written in Arabic, Spanish, Hebrew and Korean.In Clifton, New Jersey, the Palestinian American Community Centre’s priorities are calling for US officials to support a ceasefire, and the hundreds of Americans trapped in Gaza, said Ms Basma Bsharat, the education director of the centre.The centre has also been collecting cash donations to send on to UNRWA. It has asked people not to donate supplies, which it has no easy way of sending to those in need in Gaza.Last week, a woman came to the centre anyway, hauling bags filled with goods.  “We didn’t know how to say no,” said Ms Basma. “She was like, I just want to do something. I just want to help somehow.”“It’s a very difficult time, and the fact that we do see the support coming in it, it gives some relief,” she said. “It gives some kind of solace.” REUTERS",
        "Date": "2023-10-31",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/palestinian-americans-fundraise-for-gaza-as-aid-groups-receive-record-donations",
        "reranked_score": 6.103775978088379,
        "Event": "Hamas militants attacked Israel, killing 1,400 people and taking 229 hostages.",
        "Event_date": "2023-10-07"
    },
    {
        "id": "st_1157276",
        "Title": "The nightmare of delivering aid during this Israel-Hamas war",
        "Text": "The 2.3 million people who live in Gaza are facing economic isolation and experiencing incessant bombardment. Their supplies of essential resources, including food and water, are quickly dwindling.In response, US President Joe Biden has pledged US$100 million (S$136 million) in humanitarian assistance for the citizens of Gaza.Mr Biden’s promise raises fundamental questions regarding the delivery of humanitarian aid in a war zone. Political constraints, ethical quandaries and the need to protect the security of aid workers and local communities always make the effort a logistical nightmare.In this specific predicament, US officials have to choose a strategy to deliver the aid without the perception of benefiting Hamas, a group the US and Israel both classify as a terrorist organisation.LogisticsWhen aiding people in war zones, you can’t just send money, a development strategy called “cash transfers” that has become increasingly popular due to its efficiency. Sending money can boost the supply of locally produced goods and services, and help people on the ground pay for what they need most. But injecting cash into an economy so completely cut off from the world would only stoke inflation.So the aid must consist of goods that have to be brought into Gaza, and services provided by people working as part of an aid mission. Humanitarian aid can include food and water; health, sanitation and hygiene supplies and services; and tents and other materials for shelter and settlement.Due to the closure of the border with Israel, aid can arrive in Gaza only via the Rafah crossing on the Egyptian border.The US Agency for International Development, or USAid, will likely turn to its long-time partner on the ground, the United Nations Relief and Works Agency, or UNRWA, to serve as supply depots and distribute goods. That agency, originally founded in 1949 as a temporary measure until a two-state solution could be found, serves in effect as a parallel yet unelected government for Palestinian refugees.USAid will likely want to tap into UNRWA’s network of 284 schools – many of which are now transformed into humanitarian shelters housing two-thirds of the estimated one million people displaced by Israeli air strikes – and 22 hospitals to expedite distribution.PoliticsPrior to the Trump administration, the US was typically the largest single provider of aid to the West Bank and Gaza. USAid administers the lion’s share of it.Since Mr Biden took office, total yearly US assistance for the Palestinian territories has totalled around US$150 million, restored from just US$8 million in 2020 under the Trump administration. During the Obama administration, however, the US was providing more aid to the territories than it is now, with US$1 billion disbursed in the 2013 fiscal year.But the White House needs Congress to approve this assistance – a process that requires the House of Representatives to elect a new Speaker and then for lawmakers to approve aid to Gaza once that happens.EthicsThe UNRWA is a UN organisation. It is not run by Hamas, unlike, for instance, the Gaza Ministry of Health. However, Hamas has frequently undermined UNRWA’s efforts and diverted international aid for military purposes.  Hamas has repeatedly used UNRWA schools as rocket depots. It has repeatedly tunnelled beneath UNRWA schools. It has dismantled European Union-funded water pipes to use as rocket fuselages. And even since the most recent violence broke out, the UNRWA has accused Hamas of stealing fuel and food from its Gaza premises.Humanitarian aid professionals regularly have to contend with these trade-offs when deciding to what extent they can work with governments and local authorities that commit violent acts. They need to do so in exchange for the access required to help civilians under their control.Similarly, Mr Biden has had to make concessions to Israel while brokering for the freedom to send humanitarian aid to Gaza. For example, he has assured Israel that if any of the aid is diverted by Hamas, the operation will cease.This promise may have been politically necessary. But if Mr Biden already believes Hamas to be uncaring about civilian welfare, he may not expect the group to refrain from taking what it can.Security best practicesWhat can be done to protect the security of humanitarian aid operations that take place in the midst of dangerous conflicts?Under international humanitarian law, the local authorities have the primary responsibility for ensuring the delivery of aid – even when they aren’t carrying out that task. To increase the chances that the local authorities will not attack them, aid groups can give “humanitarian notification” and voluntarily alert the local government as to where they will be operating.Hamas has repeatedly flouted international norms and laws. So the question of if and how the aid convoy will be protected looms large.Under the current agreement between the US, Israel and Egypt, the convoy will raise the UN flag. International inspectors will make sure no weapons are on board the vehicles before they cross over from Arish, Egypt, to Rafah, a city located on the Gaza Strip’s border with Egypt.The aid convoy will likely cross without militarised security. This puts it at some danger of diversion once inside Gaza. But whether the aid convoy is attacked, seized or left alone, the Biden administration will have demonstrated its willingness to attempt a humanitarian relief operation. In this sense, a relatively small first convoy bearing water, medical supplies and food, among other items, serves as a test balloon for a sustained operation to follow soon after.If the US were to provide the humanitarian convoy a military escort, by contrast, Hamas could see its presence as a provocation. Washington’s support for Israel is so strong that the US could potentially be judged as a party in the conflict between Israel and Hamas.In that case, the presence of US armed forces might provoke attacks on Gaza-bound aid convoys by Hamas  fighters that otherwise would not have occurred. Combined with the mobilisation of two US Navy carrier groups in the eastern Mediterranean Sea, I’d be concerned that such a move might also stoke regional anger. It would undermine the Biden administration’s attempts to cool the situation.On UN-approved missions, aid delivery may be secured by third-party peacekeepers – meaning, in this case, personnel who are neither Israeli nor Palestinian – with the UN Security Council’s blessing. In this case, tragically, it is unlikely that such a resolution could conceivably pass such a vote, much less quickly enough to make a difference.Topher L. McDougal is professor of economic development and peace-building at the University of San Diego. This article first appeared in The Conversation. ",
        "Date": "2023-10-24",
        "Article_URL": "https://www.straitstimes.com/opinion/the-nightmare-of-delivering-aid-during-this-israel-hamas-war",
        "reranked_score": 6.039750576019287,
        "Event": "US President Joe Biden pledged $100 million in humanitarian assistance for the citizens of Gaza.",
        "Event_date": "2023-10-24"
    },
    {
        "id": "st_1157341",
        "Title": "Scaling up Gaza aid effort faces tangle of challenges",
        "Text": "CAIRO - With a trickle of aid flowing into the besieged Gaza Strip from Egypt, humanitarian staff and diplomats face a web of political, security and logistical obstacles as they try to build up and sustain deliveries of relief.The aid is desperately needed. Supplies of food, water, medicines and fuel have been running critically low for Gaza's 2.3 million people since Israel began its bombardment and \"total siege\" of the Palestinian enclave.Israel’s action is in retaliation for an attack by Hamas militants on Oct 7. But Israel's conditions for inspecting and tracking the aid, security risks transporting and distributing it, and arrangement of its passage through a crossing not used during previous conflicts for large-scale relief efforts have all hampered work to get the operation off the ground.Aid began flowing through Rafah, the main exit and entry point for Gaza that does not border Israel, on Oct 21, with up to 20 trucks crossing daily since. United Nations officials say 100 trucks are required daily to meet essential needs.During past conflicts between Israel and Hamas in Gaza, aid had mainly been delivered through crossing points with Israel.The UN aid operation for the Palestinian territories has been run through Israel since the 1950s.Now aid needs to be brought in from Egypt's Sinai Peninsula, an isolated region with a recent history of insurgent attacks and a heavily militarised border. \"It's a huge, huge undertaking to set up a humanitarian operation from scratch,\" said one aid official who asked not to be named. \"We're not set up like that, not even close, from the Egyptian side.\"BottlenecksThe aid operation was brokered in talks involving the United States, Israel and Egypt, with a deal to start with a convoy of 20 trucks clinched during a visit by US President Joe Biden to Israel last week, aid officials and diplomats say.As it began, details of an inspection system were still being worked out.Scaling up aid required a quick and light system based on random checks, such as that used for sending aid from Turkey into north-western Syria, UN aid chief Martin Griffiths said.Trucks are currently driving more than 40km south along the Egypt-Israel border to be inspected before returning to Gaza.This means a lag of several hours between their entry into the crossing on the Egyptian side and their exit into Gaza. \"There are bottlenecks,\" said Ms Abeer Etefa, a spokesperson for the World Food Programme, which brought some supplies into Gaza with the first convoys but has many more waiting on the Egyptian side of the border.\"What exactly are these bottlenecks? It's very unclear, but I think a lot of it is basically, probably the inspection mechanism and the ability of movement inside Gaza,\" she said.Some Gaza bakeries the WFP works with have been put out of operation because of shortages of fuel, a commodity that has so far not been allowed to cross because of Israeli concerns that it could be used by Hamas.Fuel is also crucial for hospital generators and water supplies, and is fast running out.    US Special Envoy David Satterfield, who has been negotiating with Israel, Egypt and the UN to set up sustained aid deliveries, told MSNBC on Oct 22 that while the critical role of fuel was understood, the provision of food, water and medicine would continue to be the focus \"in the immediate future\".Israeli authorities did not immediately respond to a request for comment.BattlefieldThe US, along with other countries, has also been negotiating to get thousands of foreign passport holders out of Gaza through Rafah.Qatar has meanwhile been leading efforts for the release of hostages taken by Hamas militants during the Oct 7 attack.Two Egyptian security sources linked scaling up of aid to Hamas's willingness to free hostages. From a total of more than 200 hostages, two were freed through Rafah late on Monday, with Hamas crediting Qatar and Egypt for their mediation. Two others were released last week.  The UN says delivery of aid should be unconditional.  On the Gaza side of the border, distribution will depend on the pattern of the conflict and mass displacement of residents, which could be further complicated by an expected Israeli ground operation. As intense bombardment continues, aid organisations have appealed for a humanitarian pause or ceasefire to deliver relief. Security guarantees, especially for northern Gaza where Israeli bombing is concentrated, had not been forthcoming, said Mr Rick Brennan, emergencies director for the World Health Organization. The UN agency for Palestinian refugees says 35 of its staff have been killed in Gaza since Oct 7.Bombardment has damaged roads and buildings around Rafah. Not long after Sunday's convoy of trucks entered the crossing, shelling from an Israeli tank hit an Egyptian position nearby, wounding several Egyptian border guards. Israel said the incident was an accident.\"We're going to have to adapt the whole logistics of the operation according to what is transpiring on the battlefield,\" said Mr Griffiths. REUTERS",
        "Date": "2023-10-24",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/scaling-up-gaza-aid-effort-faces-tangle-of-challenges",
        "reranked_score": 6.003586769104004,
        "Event": "The first convoy of aid trucks, carrying food, water, and medicine, entered Gaza through the Rafah crossing.",
        "Event_date": "2023-10-21"
    },
    {
        "id": "st_1158779",
        "Title": "Israel PM Netanyahu rejects Gaza ceasefire, says it amounts to ‘surrendering to Hamas’",
        "Text": "JERUSALEM - Prime Minister Benjamin Netanyahu said on Monday a ceasefire in the Israel’s war against Hamas “will not happen”, as the United Nations warned not enough aid was coming in to meet “unprecedented humanitarian needs”.Israeli ground forces fought inside the Gaza Strip and air strikes pounded the besieged Hamas-run Palestinian territory in response to the Oct 7 attack – the deadliest in Israel’s history.The intensifying military operations have sharply heightened fears for the 2.3 million inhabitants of Gaza, where the Hamas-controlled Health Ministry says more than 8,300 have been killed.In a briefing to foreign press, Mr Netanyahu said a ceasefire would amount to surrendering to Hamas, whose gunmen killed 1,400 people and took more than 230 hostages, according to the latest Israeli figures.“Calls for a ceasefire are calls for Israel to surrender to Hamas, to surrender to terrorism... this will not happen,” he said, vowing Israel will “fight until this battle is won”.The United States, Israel’s ally, also objected to a ceasefire.“We do not believe that a ceasefire is the right answer right now,” National Security Council spokesman John Kirby said, adding that “pauses” to get aid into Gaza should be considered instead.As Israeli forces battled Hamas militants inside the narrow Palestinian territory and sent tanks to the outskirts of Gaza City, concern has surged about the widening humanitarian crisis.Mr Kirby said Washington was “confident” of increasing the number of aid trucks to Gaza through the Rafah crossing with Egypt to around 100 a day.Limited aid has entered Gaza from Egypt under a US-brokered deal, but its volume has fallen far short of the hundreds of trucks a day aid agencies say are needed.Mr Philippe Lazzarini, head of the UN agency for Palestinian refugees UNRWA, called for the Security Council to demand an immediate humanitarian ceasefire.“The system in place to allow aid into Gaza is geared to fail unless there is political will to make the flow of supplies meaningful, matching the unprecedented humanitarian needs,” he said.Israeli tanks on Gaza highway The Hamas attack set off the bloodiest-ever Gaza war, marked by weeks of withering aerial bombardment and three continuous nights of ground operations centred on northern Gaza, which Israel has told civilians to evacuate.Columns of Israeli tanks and armoured bulldozers were seen churning through the sand, and snipers took positions inside emptied residential buildings, in footage released by the army.Dozens of tanks advanced for more than an hour into the southern fringes of Gaza City and blocked the main north-south highway, “firing at any vehicle that tries to go on it”, an eyewitness told AFP by phone.Air strikes also cratered the road and brought down buildings, residents said, before the tanks withdrew.The Israeli ground forces were supported by heavy fire from the air and artillery, with the army striking more than 600 targets within 24 hours, up from 450 reported by the military a day earlier.Hamas said it had fired anti-tank missiles at two Israeli armoured vehicles and that “blows delivered by the resistance have prevented” Israeli troops from establishing a presence in Gaza.The Israeli military also said a woman soldier was rescued from captivity after an operation in the Hamas-run territory. The release of Ms Ori Megidish was “secured during a ground operation”, the army said, adding that she had been “medically checked” and was “doing well”.Mr Netanyahu said the international community must demand the captives remaining in Gaza “be freed immediately, unconditionally”.Hamas released a video of what it said were three women hostages, seated against a tile wall, although the time and place of the recording could not be verified.One called in an agitated tone for Mr Netanyahu to agree to Hamas’ proposed exchange of the hostages for Palestinian prisoners held by Israel.Mr Netanyahu decried the clip as “cruel psychological propaganda”.‘Bombing followed us’ The more than 230 hostages – aged between a few months and above 80 – are believed to be held in a network of underground tunnels where Hamas has hid its military infrastructure from Israeli surveillance and air attacks.Israel confirmed the death of one of those missing – German-Israeli Shani Louk, 23, who was captured by Hamas when its gunmen stormed a desert music festival.Fear and desperation have spiralled in Gaza, under weeks of siege that have cut off water, food, fuel and other essentials.Internet access was severed on Friday but restored on Sunday following US pressure, State Department spokesman Matthew Miller said.“We made clear to the government of Israel over the weekend that communications networks needed to be restored,” he said on Monday. “It is about ensuring that vital information flows, humanitarian coordination continues and families can stay in touch.”The UN reported on Sunday that “thousands of people” had ransacked aid warehouses in Gaza.Donkey carts were lining up to load water, as safe drinking water has become scarce in Khan Younis in southern Gaza.According to the UN, all 10 hospitals in northern Gaza have received evacuation orders – despite sheltering thousands of patients and about 117,000 displaced people.“We were displaced from our homes to the hospital,” Gaza City resident Ashraf al-Muzani, 38, said from Al-Quds hospital where he and his family have sheltered for a week. “The bombing followed us,” he added. “We haven’t been able to sleep and our children are so frightened.”‘Highest’ UN death toll Mr Lazzarini said 64 of his colleagues had been killed in Gaza since Oct 7, “the highest number of UN aid workers killed in a conflict in such a short time”.Anti-Israel anger has flared across the region and beyond.In Russia’s Muslim-majority Dagestan, police said they had arrested 60 people after a crowd stormed an airport on Sunday to attack passengers arriving from Tel Aviv.And Russian President Vladimir Putin on Monday accused the US of being responsible for what he called “deadly chaos” unfolding in the Middle East.Washington has warned Israel’s enemies – in particular Iran-allied groups – not to become more fully involved after a series of attacks across the region. Israel’s military has struck targets in Syria and traded cross-border fire with Hezbollah in Lebanon, where caretaker Prime Minister Najib Mikati told AFP he was “doing my duty to prevent Lebanon from entering the war”.Violence has also surged in the occupied West Bank where health officials say about 120 Palestinians have been killed by Israeli fire and in settler attacks since the Gaza war started. AFP",
        "Date": "2023-10-31",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas",
        "reranked_score": 5.907919883728027,
        "Event": "Israeli Prime Minister Benjamin Netanyahu rejected a ceasefire in the ongoing war against Hamas.",
        "Event_date": "2023-10-30"
    },
    {
        "id": "st_1158878",
        "Title": "S’pore Red Cross gives $270k worth of relief aid to victims of Hamas-Israel war in Gaza",
        "Text": "SINGAPORE – As part of efforts to help the victims of the conflict in Gaza, the Singapore Red Cross (SRC) will be sending US$200,000 (S$273,000) worth of relief supplies to the war zone.The SRC said on Tuesday that the relief supplies will include items such as hygiene kits, clean water, food provisions, and medical consumables and equipment such as wheelchairs.The SRC has also deployed a staff member to Cairo, Egypt, to work with the Egyptian Red Crescent (ERC) in identifying immediate and critical needs in Gaza, and to facilitate the delivery of relief supplies in the coming days.The SRC and ERC are working closely to coordinate humanitarian aid into Gaza through the Rafah border crossing – the sole crossing point between Egypt and the Gaza Strip.They are also scaling up efforts to provide more humanitarian assistance, the SRC said.Food, water and medical supplies have been coming through the Egyptian border, but the provided aid is simply too small to meet the huge needs on the ground, according to reports.Affected communities in the Gaza Strip have received limited humanitarian aid, said the SRC statement, adding that the Palestine Red Crescent Society (PRCS) has been working under “challenging conditions” to deliver emergency assistance such as ambulance and healthcare services.“There are severe shortages of essential necessities such as fuel, water and food, while medical supplies are depleting rapidly,” said the SRC.“While some humanitarian aid has arrived in Gaza with support from the ERC and PRCS, it remains inadequate to meet the extensive needs.”SRC chief executive Benjamin William said: “We are deeply concerned about the suffering and anguish experienced by the people in Gaza. Families, children, women and the elderly are enduring unimaginable hardships.”Many victims have to walk long distances to reach safe areas and have no access to basic necessities such as shelter and water, he said.He added that damaged infrastructure and a “communication paralysis” have exacerbated the crisis, leaving victims disconnected from the outside world.“We continue to urge all parties involved to uphold their responsibilities as outlined in international humanitarian law, and prioritise the protection of civilians,” said Mr William, adding that it is important for hospitals, doctors, nurses and humanitarian workers to be protected as well.“It is essential that all parties recognise and enable unhindered critical humanitarian aid into Gaza for all the affected communities, including those who have been displaced.” Two weeks ago, the SRC launched a public fund-raising appeal for relief and recovery operations, which will close on Jan 31, 2024.The organisation earlier pledged US$150,000 to relief efforts, while the Singapore Government contributed $300,000 towards relief operations through the SRC.Members of the public who wish to make an online donation can visit redcross.sg/gazaresponse",
        "Date": "2023-10-31",
        "Article_URL": "https://www.straitstimes.com/singapore/s-pore-red-cross-gives-270k-worth-of-relief-aid-to-victims-of-hamas-israel-war-in-gaza",
        "reranked_score": 5.10781192779541,
        "Event": "The Singapore Red Cross announced it will send US$200,000 worth of relief supplies to Gaza.",
        "Event_date": "2023-10-24"
    },
    {
        "id": "st_1158236",
        "Title": "Singapore supports humanitarian aid, calls for civilian lives to be protected in Gaza",
        "Text": "SINGAPORE – Singapore has expressed its support for the efforts of United Nations Secretary-General Antonio Guterres to sustain the flow of humanitarian aid to Gaza and calls for all innocent civilian lives to be protected, said Singapore’s Ambassador to the UN Burhan Gafoor.“At the outset, I wish to express Singapore’s utmost support for the efforts of the UN Secretary-General to sustain the flow of humanitarian assistance to the civilians affected by this terrible tragedy in Gaza,” said Mr Gafoor.“We commend the Secretary-General for his leadership role in facilitating the flow of humanitarian assistance and recognise the important contributions made by UN agencies and other humanitarian organisations on the ground,” he noted.He added that Singapore supports all efforts to defuse tensions in order to avoid an escalation of the conflict.“Respect for the UN Charter and for international law has always been a fundamental guiding principle of Singapore’s foreign policy. The UN Charter and international law provide the foundation for international peace and security,” Mr Gafoor said.The ambassador made these comments at the emergency special session of the UN General Assembly in New York on Friday, as Singapore voted in support of a resolution drafted by Arab states calling for an immediate humanitarian truce.The non-binding resolution received 121 votes in favour, while 44 abstained and 14 – including Israel and the United States – voted “no”. Israel has heavily bombarded Gaza since Hamas gunmen stormed across the border on Oct 7, killing 1,400 people, mostly civilians, according to Israeli officials. Israel’s retaliatory action has killed more than 7,000 people in Gaza, according to the enclave’s Health Ministry. Mr Gafoor said: “We mourn the loss and suffering of so many innocent civilians, including children and the elderly. This attack (by Hamas) cannot be condoned or justified by any rationale. We condemn this terrorist attack in the strongest possible terms. We also call for the immediate and safe release of all hostages taken by Hamas.“In this regard, it is worth recalling that just in June this year, the General Assembly adopted a resolution on the Global Counter-Terrorism Strategy,” he noted. This, he said, calls for the international community to reiterate its “strong and unequivocal condemnation of terrorism in all its forms and manifestations, committed by whomever, wherever and for whatever purposes”.Israel has the legitimate right to defend its citizens and its territory under international law, said Mr Gafoor.However, he also pointed out that Israel also has an obligation to comply with international humanitarian law. “All parties must abide by international humanitarian law and do their utmost to protect the safety and security of civilians,” said the ambassador.He added that Singapore welcomes all efforts to establish and uphold safe zones and routes that will keep civilians out of harm’s way and allow for the delivery of humanitarian assistance. “Singapore is deeply saddened by the dire humanitarian situation in the Gaza Strip and the loss of so many civilian lives. This is a massive humanitarian crisis,” said Mr Gafoor.“We urge all parties involved to allow the rapid, safe and unhindered delivery of humanitarian aid and essential services to the civilian population in the Gaza Strip,” he added. To support humanitarian relief operations in Gaza, the Government has made a financial contribution through the Singapore Red Cross, said Mr Gafoor. Many Singaporeans have also made their own contributions to relief operations, he said, noting that it is the Republic’s hope that their contributions will reach those in need quickly. On the resolution, Mr Gafoor said that Singapore has voted in favour after very careful consideration, but added that the Republic deeply regrets that this resolution has “two glaring and significant omissions”. “First, it makes no mention of Hamas’ role in perpetrating the massive and coordinated terror attacks, which led to the brutal killing of 1,400 Israelis and others and the abduction of more than 200 hostages,” he said.“These are acts of terror that we condemn unequivocally, and the abhorrent deeds of Hamas cannot be justified by any rationale whatsoever,” said the ambassador, as he reiterated Singapore’s call for the immediate, unconditional and safe release of all civilians taken hostage. “Second, this resolution does not acknowledge Israel’s legitimate right to defend its citizens and territory in compliance with international law. As with every country, Israel has a right to defend itself from heinous terrorist attacks, to protect its people from senseless violence and to keep its territory secure,” he added.Nevertheless, Singapore supported the resolution as the Republic has “always been a consistent advocate and defender of international law, the UN Charter and the rules-based multilateral system”, said Mr Gafoor.  He pointed out that the resolution reaffirms all parties’ obligations to respect and uphold international law, including international humanitarian law. “It expresses strong support for the efforts by the Secretary-General of the United Nations, and for his calls for the immediate and unrestricted access of humanitarian aid, and to respond to the most basic needs of the Palestinian civilian population amidst the unfolding humanitarian crisis in the Gaza Strip,” said Mr Gafoor.The resolution, he said, demands that all parties immediately and fully comply with their obligations under international law, including international humanitarian law. “These obligations have been spelt out in many UN Security Council resolutions. All innocent civilian lives must be protected,” he stressed.On the Israeli-Palestinian conflict, Mr Gafoor said that it is a “longstanding one, and it must be resolved in accordance with international law and relevant UN Security Council resolutions”. He called it the only way to stop the repeated cycles of violence. “Singapore’s position on the Israeli-Palestinian conflict has been consistent. We continue to hold the view that the only viable path to a durable, just and comprehensive solution is a negotiated two-state solution, consistent with the relevant UN Security Council resolutions,” he said. Mr Gafoor also stressed that Singapore calls on leaders from both sides to show leadership, to exercise restraint and to take the difficult but necessary steps towards the vision of a two-state solution.“We support the right of the Palestinian people to a homeland, and Israel’s right to live within secure borders. Both Palestinians and Israelis deserve to live in peace, security and dignity,” he added.",
        "Date": "2023-10-28",
        "Article_URL": "https://www.straitstimes.com/singapore/s-pore-supports-humanitarian-aid-calls-for-civilian-lives-to-be-protected-in-gaza-s-pore-un-ambassador",
        "reranked_score": 4.371120929718018,
        "Event": "Singapore expressed its support for humanitarian aid to Gaza and called for the protection of civilians.",
        "Event_date": "2023-10-27"
    },
    {
        "id": "st_1162923",
        "Title": "Aid supplies to Gaza halted again, UN says starvation imminent   ",
        "Text": "GAZA/JERUSALEM – United Nations aid deliveries to Gaza were suspended again on Nov 17 due to shortages of fuel and a communications shutdown, deepening the misery of thousands of hungry and homeless Palestinians as Israeli troops battled Hamas militants in the enclave. The UN World Food Programme (WFP) said civilians faced the “immediate possibility of starvation” due to the lack of food supplies. Palestinian news agency Wafa said a number of Palestinians were killed and others injured in an Israeli strike that hit a group of displaced people near the Rafah border crossing between the Gaza Strip and Egypt – the transit point for aid. Al Jazeera TV cited sources as saying that nine people were killed in the strike. There was no immediate comment from Israel on the reported strike, and Reuters could not verify it.In other developments, Israel said its troops had found a tunnel shaft used by Hamas at Al-Shifa Hospital in the north of the Gaza Strip.The hospital, packed with patients and displaced people and struggling to keep operating, has been a major focus of global concern this week. Israel says Hamas has stored weapons and ammunition and is holding hostages in a network of tunnels under hospitals like Shifa, using patients and people taking shelter there as human shields. Hamas denies this.With the war about to enter its seventh week, there is no sign of any let-up despite international calls for a ceasefire or at least for humanitarian pauses.The conflict was triggered by a cross-border raid by Hamas militants on Oct 7 that killed about 1,200 Israelis, mostly civilians, in the deadliest day in the state’s 75-year-history.More than 11,500 Palestinians, at least 4,700 of them children, have now been killed in Israel’s retaliatory military assault on Hamas-ruled Gaza, according to the Palestinian Health Ministry – a toll that far surpasses previous bouts of conflict in recent years.Israel has vowed to wipe out the militant group. Whole neighbourhoods of Gaza have been flattened in air and artillery strikes, hundreds of thousands of people have been forced to flee their homes, and the humanitarian situation is catastrophic, aid agencies say.Trucks suspendedThe UN said there would be no cross-border aid operation on Nov 17 due to fuel shortages and a communication shutdown.  For a second consecutive day on Nov 16, no aid lorries arrived in Gaza due to lack of fuel for distributing relief.WFP executive director Cindy McCain said nearly the entire population was in desperate need of food assistance.“Supplies of food and water are practically non-existent in Gaza and only a fraction of what is needed is arriving through the borders,” she said in a statement.“With winter fast approaching, unsafe and overcrowded shelters, and the lack of clean water, civilians are facing the immediate possibility of starvation,” Ms McCain said.A UN human rights official said Israel must allow water and fuel into Gaza to restart the water supply network.“Every hour that passes with Israel preventing the provision of safe drinking water in the Gaza Strip, in brazen breach of international law, puts Gazans at risk of dying of thirst and diseases,” Mr Pedro Arrojo-Agudo said.The World Health Organisation on Nov 17 said it was very worried about the spread of disease in Gaza, citing more than 70,000 reported cases of acute respiratory infections and over 44,000 cases of diarrhoea, far more than expected.The Israeli military’s chief of staff said Israel was close to destroying Hamas’ military system in the northern Gaza Strip, and there were signs the army was taking its campaign to other parts of the coastal enclave of 2.3 million people.Israel accused Hamas of preventing people from heading to the south of the Gaza Strip, which the militant group denied.The army released a video it said showed a tunnel entrance in an outdoor area of Al-Shifa, Gaza’s biggest hospital.The video, which Reuters could not immediately verify, showed a deep hole in the ground, littered with and surrounded by concrete and wood rubble and sand. It appeared the area had been excavated. A bulldozer appeared in the background.The army said its troops also found a vehicle in the hospital containing a large number of weapons.Reuters journalists have been unable to reach anyone inside Al-Shifa Hospital for more than 24 hours.Hamas on Nov 16 said claims by the United States that the group uses Shifa for military purposes were “a repetition of a blatantly false narrative, demonstrated by the weak and ridiculous performances of the occupation army spokesman”. Israeli officials said Hamas held some of the 240 hostages taken by gunmen on Oct 7 in the hospital complex.On Nov 17 the Israeli military said soldiers retrieved the body of a female soldier who had been held captive in a building near Shifa.The military confirmed her death on Nov 14 after Hamas issued a video of her alive, followed by images of what it said was her body after she was killed in an Israeli strike.On Nov 16, troops recovered the body of another woman hostage, also in a building near Shifa.In the Israeli-occupied West Bank, Hamas’ Al-Quds Brigades said they had engaged Israeli forces for several hours in the city of Jenin overnight into Nov 17, unleashing a “torrent of fire” and laying ambushes with explosives.Israel’s military said warplanes struck militants in Jenin who had opened fire on Israeli soldiers. It said at least five of the militants were killed.At least 178 Palestinians have been killed in the West Bank since the Oct 7 Hamas attack on Israel. The violence there has underscored fears that the territory, seized by Israel in the 1967 Middle East War, could spiral out of control in tandem with the conflict in Gaza. REUTERS",
        "Date": "2023-11-17",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/aid-supplies-to-gaza-halted-again-un-says-starvation-imminent",
        "reranked_score": 4.301633834838867,
        "Event": "The United Nations suspended aid deliveries to Gaza due to fuel shortages and a communications shutdown.",
        "Event_date": "2023-11-17"
    },
    {
        "id": "st_1153853",
        "Title": "UN human rights chief condemns Palestinian violence, warns against ‘siege’ of Gaza",
        "Text": "GENEVA –  The United Nations’ high commissioner for human rights on Tuesday condemned allegations of mass killings and executions by Palestinian armed groups, as he warned that Israel’s announcement of a “complete siege” of Gaza would exacerbate the “already dire” humanitarian situation in the coast.“All parties must respect international humanitarian law,” Mr Volker Turk said in a statement. “They must immediately cease attacks targeting civilians and attacks expected to cause disproportionate death and injury of civilians or damage to civilian objects.”As Israeli warplanes struck hundreds of sites on Monday, Israel’s defence minister said “no electricity, no food, no water, no fuel” would be allowed into Gaza, which is controlled by the militant group Hamas and is under a 16-year blockade by Israel and Egypt that heavily restricts access for people and goods. Mr Turk said the ability of medical facilities to treat the growing number of people wounded in Israeli strikes would be harmed by a “full siege”.  “The imposition of sieges that endanger the lives of civilians by depriving them of goods essential for their survival is prohibited under international humanitarian law,” he said. He added that restrictions on people and goods must be “justified by military necessity” or may amount to collective punishment.The Palestinian Health Ministry in Gaza warned on Sunday of large shortages of medicine and health equipment, as well as fuel required to keep hospital electrical generators running.Mr Turk also said he was “deeply shocked and appalled by allegations of summary executions of civilians, and, in some instances, horrifying mass killings by members of Palestinian armed groups”. He called on Palestinian armed factions to immediately release Israeli civilians who were taken hostage. About 150 people are believed to have been abducted by Palestinian gunmen in the attacks that began on Saturday.“It is horrific and deeply distressing to see images of those captured by Palestinian armed groups being ill-treated, as well as reports of killings and the desecration of their bodies,” he said. “Civilians must never be used as bargaining chips.”The World Health Organisation (WHO) called on Tuesday for a humanitarian corridor to be established into and out of the Gaza.The WHO had reported 13 attacks on health facilities in Gaza since the weekend, and that the organisation’s medical supplies stored there had already been used up. “WHO is calling for an end to the violence… A humanitarian corridor is needed to reach people with critical medical supplies,” WHO spokesman Tarik Jasarevic told journalists in Geneva.“We need supplies to come in: hospitals cannot run without fuel, without electricity.“The supplies that we have pre-positioned are already running low so we need those supplies to come,” Mr Jasarevic said.The United Nations humanitarian office said nearly 200,000 people, or nearly a tenth of the population, have fled their homes in Gaza since the start of hostilities.  AFP, REUTERS                  ",
        "Date": "2023-10-10",
        "Article_URL": "https://www.straitstimes.com/world/middle-east/who-calls-for-humanitarian-corridor-into-gaza-as-war-displaces-over-200000",
        "reranked_score": 3.3527657985687256,
        "Event": "The UN human rights chief condemned allegations of mass killings and executions by Palestinian armed groups.",
        "Event_date": "2023-10-10"
    },
    {
        "id": "st_1163000",
        "Title": "Israel to allow some fuel into Gaza after US push",
        "Text": "JERUSALEM/WASHINGTON - Israel's war Cabinet has agreed to allow 140,000 litres of fuel into Gaza every two days, after a request from Washington, amid acute shortages that threatened aid deliveries and communications in the besieged strip, Israel and US officials said on Friday.Israel imposed a strict blockade on all goods entering Hamas-controlled Gaza when it launched a military campaign in response to the Palestinian militant group's Oct 7 rampage, in which they killed 1,200 people and took 240 hostages.Israel has since agreed to allow in aid trucks after stringent inspections, and a small amount of fuel was allowed in on Wednesday to keep United Nations Relief and Works Agency (UNRWA) aid delivery trucks moving.An Israeli official who declined to be identified said two trucks a day would be allowed in to meet the UN's needs, but said the amount would give \"minimal\" support for water, sewage and sanitary systems in Gaza to prevent pandemics.A US State Department official, offering more details, said Israel had committed to allowing in 120,000 litres of fuel every 48 hours for UNRWA's trucks and other needs like desalinisation of water, sewage pumping, bakeries and hospitals in the south of Gaza.An additional 20,000 litres every two days would be allowed in to power generators of telecoms company Paltel, which had warned of an imminent blackout of its cellphone network due to lack of fuel. US officials have been pushing Israel to allow fuel in for some time. But Secretary of State Antony Blinken made calls to members of Israel's war Cabinet on Wednesday, and warned that the fuel shortage risked a humanitarian catastrophe among Gaza's 2.3 million residents, the State Department official said. Israeli officials had previously argued that Hamas should release hostages before it eased the pressure on Gaza, the official said, adding that negotiations on the release of hostages continue separate from the move on fuel.    The Israeli official confirmed the decision came after a request from Washington, and said allowing the fuel in gives Israel extra room to maneuver in the international arena so it can continue its campaign to eradicate Hamas in Gaza. REUTERS",
        "Date": "2023-11-18",
        "Article_URL": "https://www.straitstimes.com/world/israel-to-allow-some-fuel-into-gaza-after-us-push-officials",
        "reranked_score": 3.333937883377075,
        "Event": "Israel agreed to allow 140,000 liters of fuel into Gaza every two days after a request from the United States.",
        "Event_date": "2023-11-17"
    }
]