[
    {
        "Date": "2020-11-10",
        "Event": "Azerbaijan seized back significant amounts of territory it had lost to Armenian forces in the 1990s.",
        "Article_id": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-07",
        "Event": "Armenia accused Azerbaijan of conducting an “ongoing military build-up along the line of contact in Nagorno-Karabakh and the Armenia-Azerbaijan border”.",
        "Article_id": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-07",
        "Event": "Azerbaijan’s foreign ministry rejected the Armenian assertion and called on Yerevan to end what Baku called “military and political provocations.”",
        "Article_id": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-07",
        "Event": "Russia said on Thursday it was continuing to fulfil its role as a security guarantor in the South Caucasus.",
        "Article_id": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-07",
        "Event": "Kremlin spokesman Dmitry Peskov criticised Armenia’s decision to host a joint exercise involving 85 US soldiers next week as unhelpful.",
        "Article_id": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2022-09-20",
        "Event": "Azerbaijan took control of Nagorno-Karabakh after three decades in a lightning military operation and vowed to prosecute the \"criminal\" separatist leadership.",
        "Article_id": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-09-12",
        "Event": "Russian truck sets off with food aid for Armenians in Khankendi - Reuters witness.",
        "Article_id": "j40zdfvo5mm8yv3c"
    },
    {
        "Date": "2023-09-21",
        "Event": "Prime Minister Nikol Pashinyan emphasizes the importance of peace for Armenia's continued independence following the surrender of the Nagorno-Karabakh region to Azerbaijan.",
        "Article_id": "9owr18ngmcvsob4x"
    },
    {
        "Date": "2020",
        "Event": "Under Pashinyan's presidency, Azerbaijan regained control of territories in the Nagorno-Karabakh region that had been under the control of ethnic Armenian separatists for three decades, culminating in the region's complete capture this week.",
        "Article_id": "9owr18ngmcvsob4x"
    },
    {
        "Date": "2023-09-20",
        "Event": "Azerbaijani armed forces attacked Kochoghot village in the Martakert district of Karabakh after attacks on its own citizens.",
        "Article_id": "kgiisc7nhbtx8o7o"
    },
    {
        "Date": "2023-09-25",
        "Event": "Petya Grigoryan and thousands of other Armenians fled Karabakh to Armenia after a 24-hour Azerbaijani military operation.",
        "Article_id": "kgiisc7nhbtx8o7o"
    },
    {
        "Date": "2023-09-20",
        "Event": "Thousands of Armenians gathered at the airport in Nagorno-Karabakh after a ceasefire agreement was reached with Azerbaijan.",
        "Article_id": "8pjpbua9arko3ovu"
    },
    {
        "Date": "2023-09-20",
        "Event": "Several hundred protesters gathered in the Armenian capital to demand that the government to do more to support ethnic Armenians in Nagorno-Karabakh.",
        "Article_id": "vehvbiu65a6u2ryr"
    },
    {
        "Date": "2023-09-19",
        "Event": "Ethnic Armenian separatist authorities reported a major escalation of hostilities in Azerbaijan's Nagorno-Karabakh region, as Azerbaijan launched an offensive.",
        "Article_id": "bon7mzog28fpzkqk"
    }
]
