[
    {
        "Date": "2012-10-31",
        "Event": "The industry appealed for changes to the COE system specifically for taxis.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2022-10-31",
        "Event": "COE premiums have doubled from what they were a year ago, meaning that vehicle prices have also increased significantly.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-09-29",
        "Event": "The Land Transport Authority (LTA) announced the reallocation of 300 additional COEs for smaller cars and less powerful EVs, equally distributed between the two October tender exercises. This reallocation aimed to address the anticipated surge in demand from car buyers following the September announcement of changes to the Vehicular Emissions Scheme (VES).",
        "Article_id": "lc0braszutiz8f8s"
    },
    {
        "Date": "2023-10-04",
        "Event": "The Open category COE premium crossed the $150,000 mark, reaching a new all-time high of $152,000 at the latest tender exercise. The increase was attributed to dealers accumulating Open category COEs to register cars before the 2024 rebate reduction and to meet their year-end sales targets.",
        "Article_id": "lc0braszutiz8f8s"
    },
    {
        "Date": "2023-10-04",
        "Event": "The COE premium for larger cars with engines above 1,600cc and 130bhp, or more powerful EVs exceeding 110 kilowatts, climbed to $146,002, representing a 3.63% increase over the previous high set two weeks prior.",
        "Article_id": "lc0braszutiz8f8s"
    },
    {
        "Date": "2023-10-04",
        "Event": "The number of bids in the COE category for smaller cars and less powerful EVs exceeded 1,000 for the first time since October 2021, with nearly 200 bids entered in the final five minutes before the tender closed. This surge was likely fueled by the revised VES incentives and the stricter pollutant thresholds coming into effect from 2024.",
        "Article_id": "lc0braszutiz8f8s"
    },
    {
        "Date": "2023-10-11",
        "Event": "The publication of an article titled \"Forum: Consequences of having sky-high COE prices\" in a Singaporean publication, discussing the sharp rise in certificate of entitlement (COE) premiums in recent months. The article highlights the government's policy of limiting COEs to control the vehicle population, leading to high premiums due to limited supply. The article then delves into the consequences of these high premiums, including rising cost of living, a potential brain drain as middle-income groups consider leaving Singapore, and a potential widening income gap.",
        "Article_id": "17ywn2lbldj116ly"
    },
    {
        "Date": "2023-10-31",
        "Event": "COE premiums are expected to continue rising.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-10-31",
        "Event": "The Straits Times hosted a podcast discussing COE price increases and potential solutions.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-10-31",
        "Event": "Industry experts, Mr Neo Tiam Ting and Mr Neo Nam Heng, were interviewed for the podcast to provide insights on COE prices and potential solutions.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-10-31",
        "Event": "Industry experts believe that the increase in COE premiums is due to an increase in demand from private-hire fleet owners.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-10-31",
        "Event": "Experts are calling for a \"lock-in period\" for car ownership similar to HDB flats.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-10-31",
        "Event": "Experts believe that car rental companies are making too much profit.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2023-11-06",
        "Event": "Acting Transport Minister Chee Hong Tat announced in Parliament that the government will bring forward COEs guaranteed to expire in the future to fill the current supply shortage. This measure aims to address the surge in COE prices and stabilize the market.",
        "Article_id": "vwpn0hyyt4e3awhb"
    },
    {
        "Date": "2023-11-08",
        "Event": "COE premiums fell across all five categories at the tender exercise, with Category B premiums plummeting by $40,000 and the Open category by nearly $33,000. This marked a significant drop after six consecutive tender exercises with record-breaking premiums.",
        "Article_id": "vwpn0hyyt4e3awhb"
    },
    {
        "Date": "2023-11-09",
        "Event": "Following the COE tender on Nov 8, 23 authorized dealerships revised their prices downwards. The steepest drops were for Category B COE cars, with most prices decreasing by $25,000 to $35,000. Audi dealer Premium Automobiles advertised “massive COE savings of up to $50,000” for their Category B cars. ",
        "Article_id": "vwpn0hyyt4e3awhb"
    },
    {
        "Date": "2023-11-14",
        "Event": "Motor dealers expect the increased car COE supply between November and January to continue keeping prices in check in 2024. This is a 35 percent increase compared to the August to October period.",
        "Article_id": "vwpn0hyyt4e3awhb"
    },
    {
        "Date": "2023-11-22",
        "Event": "Motor dealers, such as Eurokars Auto BMW, expect premiums to rebound at the next tender exercise ending on Nov 22, given the strong order intake over the weekend.",
        "Article_id": "vwpn0hyyt4e3awhb"
    },
    {
        "Date": "2024-01-01",
        "Event": "A new testing protocol for qualifying cars for sale comes into effect, expected to provide less favorable ratings compared to existing standards.",
        "Article_id": "lc0braszutiz8f8s"
    },
    {
        "Date": "2024-01-01",
        "Event": "The revised Vehicular Emissions Scheme (VES) with stricter pollutant thresholds and reduced incentives for most hybrids and some powerful EVs comes into effect.",
        "Article_id": "lc0braszutiz8f8s"
    },
    {
        "Date": "2024-02-01",
        "Event": "Motor dealers anticipate COE premiums to trend downwards in the next quota period of February to April, and remain suppressed for the rest of 2024, due to the government's assurance of continued increasing COE quotas.",
        "Article_id": "vwpn0hyyt4e3awhb"
    },
    {
        "Date": "2024-10-31",
        "Event": "Cars are expected to become even more expensive.",
        "Article_id": "36hjxw5rhkx90i84"
    },
    {
        "Date": "2026",
        "Event": "The government expects COE supply to peak in 2026 and 2027.",
        "Article_id": "vwpn0hyyt4e3awhb"
    }
]