[
    {
        "Date": "2023-11-07",
        "Event": "Israel launches a military offensive in Gaza, aiming to eliminate Hamas after a deadly cross-border assault on Oct 7.",
        "Article_id": "pcc5muz8fbpivl7d"
    },
    {
        "Date": "2023-11-11",
        "Event": "Fuel supplies run out at Al-Shifa hospital, resulting in the deaths of eight babies due to the lack of electricity to run incubator units.",
        "Article_id": "9374ojr66hnevmhg"
    },
    {
        "Date": "2023-11-12",
        "Event": "Israel offers to evacuate babies from Al Shifa hospital after two newborns die due to fuel shortage.",
        "Article_id": "pcc5muz8fbpivl7d"
    },
    {
        "Date": "2023-11-12",
        "Event": "Israeli military announces its willingness to help evacuate babies from Al Shifa hospital at the request of the hospital staff.",
        "Article_id": "lof2tcw594hrdhjd"
    },
    {
        "Date": "2023-11-12",
        "Event": "Israeli tanks and troops storm into Gaza and seize wide areas in the north and northwest.",
        "Article_id": "i9ihivdhoxkpzqlz"
    },
    {
        "Date": "2023-11-12",
        "Event": "Reports of a potential hostage deal emerge, with Israel expressing hope for the release of a significant number of hostages in the coming days.",
        "Article_id": "i9ihivdhoxkpzqlz"
    },
    {
        "Date": "2023-11-14",
        "Event": "Israeli military shares evidence of weapons and hostages being held in the basement of Rantissi Hospital, a children's hospital in Gaza.",
        "Article_id": "gg689saxdq0uw7us"
    },
    {
        "Date": "2023-11-18",
        "Event": "The World Health Organization (WHO) describes Al-Shifa hospital as a “death zone” after sending a team to visit the facility.",
        "Article_id": "9374ojr66hnevmhg"
    },
    {
        "Date": "2023-11-18",
        "Event": "Hundreds of people flee Al-Shifa hospitals, with the hospital director stating the evacuations occurred after Israeli army orders to empty the facility.",
        "Article_id": "9374ojr66hnevmhg"
    },
    {
        "Date": "2023-11-19",
        "Event": "Al-Shifa hospital becomes a focal point for Israeli operations, with the army claiming Hamas uses it as a base. Hamas and medical staff deny the accusations.",
        "Article_id": "9374ojr66hnevmhg"
    },
    {
        "Date": "2023-11-20",
        "Event": "Medics safely evacuate 31 premature babies from war-torn Al-Shifa hospital in Gaza City to a hospital in Rafah.",
        "Article_id": "9374ojr66hnevmhg"
    }
]