[
    {
        "Date": "2020-09-27",
        "Event": "Azerbaijan launched a large-scale offensive against the self-proclaimed Republic of Artsakh (Nagorno-Karabakh), marking the beginning of the Second Karabakh War.",
        "Contextual_Annotation": "This offensive marked the beginning of a six-week conflict that resulted in Azerbaijan regaining control of several territories in Nagorno-Karabakh and surrounding regions.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2020-11-10",
        "Event": "A tripartite ceasefire agreement was signed between Armenia, Azerbaijan, and Russia, ending the 2020 Nagorno-Karabakh war.",
        "Contextual_Annotation": "The ceasefire agreement, brokered by Russia, brought an end to the six-week conflict and formally returned Nagorno-Karabakh to Azerbaijani control, marking a significant shift in the regional power dynamics.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2022-03-24",
        "Event": "Azerbaijan accused Armenia of violating the ceasefire, sparking tensions between the two countries.",
        "Contextual_Annotation": "This accusation marked the beginning of a period of heightened tensions along the border between Armenia and Azerbaijan, setting the stage for further escalations throughout the year.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2022-08-03",
        "Event": "Clashes erupted between Armenian and Azerbaijani forces along the border, resulting in several casualties.",
        "Contextual_Annotation": "These clashes marked a significant escalation of the ongoing tensions between Armenia and Azerbaijan, demonstrating the fragility of the ceasefire and the ongoing dispute over Nagorno-Karabakh.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-03-24",
        "Event": "Azerbaijan launched a military operation in Nagorno-Karabakh, aiming to regain control of the disputed territory.",
        "Contextual_Annotation": "This military operation marked a significant escalation of the conflict, leading to renewed fighting between Armenian and Azerbaijani forces and a dramatic shift in the control of the region. The operation came after months of escalating tensions and a de facto blockade by Azerbaijan.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-03-27",
        "Event": "Russia deployed peacekeepers to Nagorno-Karabakh to monitor the ceasefire.",
        "Contextual_Annotation": "The deployment of Russian peacekeepers represented a significant attempt to stabilize the situation and prevent further escalation, although sporadic fighting continued, highlighting the difficulty of implementing a lasting peace agreement.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-07-20",
        "Event": "Azerbaijan announced the capture of several villages in Nagorno-Karabakh.",
        "Contextual_Annotation": "This announcement signaled significant territorial gains by Azerbaijan, raising concerns about the ongoing conflict and the fate of the Armenian population in Nagorno-Karabakh. This advancement followed months of tensions and a de facto blockade enforced by Azerbaijan.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-08-03",
        "Event": "Azerbaijan launched a new offensive in Nagorno-Karabakh, escalating tensions.",
        "Contextual_Annotation": "This offensive represented a further escalation of the conflict, leading to renewed fighting and a subsequent ceasefire agreement that was quickly violated, highlighting the fragility of any peace agreement.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-08-04",
        "Event": "Azerbaijan and Armenia agreed to a new ceasefire, but it was violated within hours.",
        "Contextual_Annotation": "The short-lived ceasefire underscored the immense challenges in achieving a lasting peace agreement between the two countries. The ongoing dispute over Nagorno-Karabakh continues to fuel tensions and violence.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-08",
        "Event": "Armenia accused Azerbaijan of conducting a military build-up along the border of Nagorno-Karabakh and the Armenia-Azerbaijan border.",
        "Contextual_Annotation": "This accusation followed Azerbaijan restricting movement along the only road to Nagorno-Karabakh from Armenia, citing concerns about arms smuggling.  The accusations, exchanged through official statements,  further escalated tensions between the two countries, despite their stated commitment to a peace process.",
        "Article": "x6bs26mxih4wjnvb"
    },
    {
        "Date": "2023-09-11",
        "Event": "Separatists in Karabakh refused to accept the cargo of a Russian Red Cross truck carrying aid, despite a deal announced with ethnic Armenian separatists to open the route for the first time in decades.",
        "Contextual_Annotation": "This refusal underscored the deep mistrust and ongoing tensions between Azerbaijan and Armenia, further complicating the humanitarian situation in Nagorno-Karabakh.  The incident occurred despite a previous agreement to open the route for humanitarian aid, highlighting the fragility of peace efforts in the region.",
        "Article": "j40zdfvo5mm8yv3c"
    },
    {
        "Date": "2023-09-12",
        "Event": "Azerbaijan and Armenia agreed to a third ceasefire, which was implemented with the support of Russia.",
        "Contextual_Annotation": "This ceasefire agreement brought a temporary respite to the ongoing conflict, providing a crucial window for negotiations and the delivery of humanitarian aid. This agreement was facilitated by Russia, demonstrating its role as a key mediator in the conflict.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-12",
        "Event": "A Russian truck carrying food aid for Armenians in the Karabakh city of Khankendi set off via the Aghdam road, according to a Reuters witness and local media.",
        "Contextual_Annotation": "This event marked a rare instance of cooperation between Azerbaijan and Russia in delivering humanitarian aid to Armenians in Nagorno-Karabakh, signifying a potential shift in the tense relationship between the two sides.",
        "Article": "j40zdfvo5mm8yv3c"
    },
    {
        "Date": "2023-09-19",
        "Event": "Ethnic Armenian separatist authorities reported a major escalation of hostilities in Azerbaijan's Nagorno-Karabakh region, as Azerbaijan launched an offensive.",
        "Contextual_Annotation": "This escalation marked a turning point in the conflict, with Azerbaijan claiming it was launching \"anti-terrorist measures\" in response to what it termed \"terrorist provocations\" by Armenian forces. Azerbaijan's actions came after months of increasing tensions and accusations by Armenia that Russia, the guarantor of a 2020 ceasefire, had failed to uphold its peacekeeping role.",
        "Article": "bon7mzog28fpzkqk"
    },
    {
        "Date": "2023-09-20",
        "Event": "Azerbaijan regained control of Nagorno-Karabakh after a three-decade-long Armenian occupation.",
        "Contextual_Annotation": "This swift military operation concluded a decades-long conflict and marked a decisive victory for Azerbaijan, leading to a major shift in the regional landscape and prompting a mass exodus of the region's Armenian population to Armenia.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-09-20",
        "Event": "Thousands of Armenians gathered at the airport in Stepanakert, Nagorno-Karabakh, following a ceasefire agreement that would result in the surrender of separatist forces to Azerbaijan. Separatists urged the population not to rush to the airport, but many ignored the warnings, seeking refuge and safety amid the uncertainty.",
        "Contextual_Annotation": "This event highlighted the fear and desperation among Armenians in Nagorno-Karabakh as they faced an uncertain future under Azerbaijani control. The Russian peacekeeping forces at the airport provided a sense of security and a potential escape route for those seeking to leave the region.",
        "Article": "8pjpbua9arko3ovu"
    },
    {
        "Date": "2023-09-20",
        "Event": "Azerbaijani President Ilham Aliyev said he had given a strict order to all military units that the Armenian population living in the Karabakh region should not be affected by the anti-terrorist measures and that the civilian population be protected.",
        "Contextual_Annotation": "This statement was made by Aliyev in a televised address to the nation on September 20th, 2023, just prior to the Azerbaijani military operation in Nagorno-Karabakh. This statement was likely intended to reassure the Armenian population and the international community that Azerbaijan would uphold civilian protection during its military action.",
        "Article": "kgiisc7nhbtx8o7o"
    },
    {
        "Date": "2023-09-20",
        "Event": "Several hundred protesters gathered in the Armenian capital to demand that the government do more to support ethnic Armenians in Nagorno-Karabakh after the breakaway region was forced into a humiliating surrender by Azerbaijan.",
        "Contextual_Annotation": "This protest erupted in the aftermath of a ceasefire agreement between Armenian separatist forces and Azerbaijan, which signaled the return of Nagorno-Karabakh to Azerbaijani control.  The protesters, including many young individuals, expressed their frustration and anxiety about the situation, calling for stronger government action to support the Armenian population in the region.",
        "Article": "vehvbiu65a6u2ryr"
    },
    {
        "Date": "2023-09-21",
        "Event": "Armenian Prime Minister Nikol Pashinyan urges peace after Azerbaijan retakes Karabakh.",
        "Contextual_Annotation": "Pashinyan's statement came after Azerbaijan's decisive military victory in the Nagorno-Karabakh region. The fall of Karabakh had fueled calls for Pashinyan's resignation within Armenia, highlighting the political and social turmoil following the defeat.",
        "Article": "9owr18ngmcvsob4x"
    },
    {
        "Date": "2023-09-21",
        "Event": "Azerbaijan's President Ilham Aliyev expresses willingness for wider peace negotiations with Armenia.",
        "Contextual_Annotation": "Aliyev's statement suggested a shift towards a more diplomatic resolution of the conflict. It followed Azerbaijan's military success in retaking Karabakh and underscored the possibility of a negotiated settlement between the two countries.",
        "Article": "9owr18ngmcvsob4x"
    },
    {
        "Date": "2023-09-21",
        "Event": "Pashinyan emphasizes the importance of peace for Armenian independence, sovereignty, and security.",
        "Contextual_Annotation": "Pashinyan's remarks focused on the vital role of peace in safeguarding Armenia's national interests. This statement came amidst a complex situation involving the loss of Karabakh and the calls for his resignation, underscoring the importance of a stable and peaceful future for Armenia.",
        "Article": "9owr18ngmcvsob4x"
    },
    {
        "Date": "2023-09-24",
        "Event": "The ethnic Armenian leadership of breakaway Nagorno-Karabakh says the terms of the ceasefire with Azerbaijan are being implemented, with work proceeding on the delivery of humanitarian aid and evacuation of the wounded.",
        "Contextual_Annotation": "This statement indicated the beginning of a transition period following the recent ceasefire agreement, with humanitarian assistance being delivered and wounded individuals being evacuated. This period signifies a possible shift towards a more stable situation in the region, although long-term stability remains uncertain.",
        "Article": "m5vcc0dfsmuho41p"
    },
    {
        "Date": "2023-09-25",
        "Event": "Petya Grigoryan, a 69-year-old driver, fled his village in the Martakert district of Karabakh after it was heavily bombed by Azerbaijani armed forces. Grigoryan said there were two KAMAZ-truckloads full of civilian dead in the village and that they had no place to bury them. He and his family were among the first ethnic Armenians of Nagorno-Karabakh to make it to Armenia after a lightning 24-hour Azerbaijani military operation defeated the Karabakh Armenian forces.",
        "Contextual_Annotation": "Grigoryan's account highlights the brutal reality of the Azerbaijani military operation, emphasizing the heavy civilian casualties and the subsequent displacement of Armenian residents from Nagorno-Karabakh. This incident occurred in the immediate aftermath of the Azerbaijani operation, underscoring the swift and decisive nature of the conflict.",
        "Article": "kgiisc7nhbtx8o7o"
    },
    {
        "Date": "2023-09-27",
        "Event": "Azerbaijan vowed to prosecute the separatist leadership of Nagorno-Karabakh.",
        "Contextual_Annotation": "Azerbaijan's announcement highlighted its intent to hold the former leaders of the self-proclaimed republic accountable for their actions during the conflict, further intensifying tensions and raising concerns about the fate of those remaining in the region.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-10-04",
        "Event": "Four ex-leaders of Nagorno-Karabakh were detained by Azerbaijan's State Security Service and taken to Baku.",
        "Contextual_Annotation": "This event marked a concrete step towards Azerbaijan's stated intention to pursue legal action against the former separatist leaders. The arrests of Ruben Vardanyan, Levon Mnatsakanyan, Arkady Gukasyan, Bako Sahakyan, Araik Arutyunyan, and David Ishkhanyan demonstrated Azerbaijan's commitment to asserting control over the region and establishing its authority.",
        "Article": "96moyhcopwdgflfi"
    },
    {
        "Date": "2023-10-04",
        "Event": "Three other former leaders of Nagorno-Karabakh arrived safely in Armenia.",
        "Contextual_Annotation": "This event highlighted the movement of some former leaders of Nagorno-Karabakh to Armenia, suggesting a potential shift in the conflict's narrative and potentially setting the stage for a new chapter in the conflict, with Armenia playing a more prominent role in the aftermath of Azerbaijan's victory.",
        "Article": "96moyhcopwdgflfi"
    }
]