[
    {
        "Date": "June 2023",
        "Event": "The UN General Assembly adopted a resolution on the Global Counter-Terrorism Strategy, reaffirming the international community’s condemnation of terrorism in all its forms.",
        "Contextual_Annotation": "This resolution underscores the global commitment to combat terrorism in all its forms and reaffirms the importance of international cooperation in this fight.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/singapore/s-pore-supports-humanitarian-aid-calls-for-civilian-lives-to-be-protected-in-gaza-s-pore-un-ambassador"
            ]
        ]
    },
    {
        "Date": "07 October 2023",
        "Event": "Hamas militants launched a surprise attack on southern Israel, killing over 1,400 people, mostly civilians, and taking over 230 hostages. This attack marked the deadliest in Israel's history and triggered Israel's massive retaliation, marking the start of the ongoing conflict between Israel and Hamas.",
        "Contextual_Annotation": "This attack, described by many as a turning point in the Israel-Hamas conflict, led to a devastating escalation with Israel launching airstrikes and ground offensives in response.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/un-chief-warns-gaza-growing-more-desperate-by-the-hour"
            ],
            [
                "https://www.straitstimes.com/world/middle-east/un-bodies-make-united-call-for-humanitarian-ceasefire-in-gaza"
            ],
            [
                "https://www.straitstimes.com/world/middle-east/g7-foreign-ministers-support-extension-of-pause-in-fighting-in-gaza"
            ],
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ],
            [
                "https://www.straitstimes.com/world/middle-east/gazans-call-for-truce-to-be-extended-israelis-divided-on-the-issue"
            ],
            [
                "https://www.straitstimes.com/singapore/s-pore-supports-humanitarian-aid-calls-for-civilian-lives-to-be-protected-in-gaza-s-pore-un-ambassador"
            ],
            [
                "https://www.straitstimes.com/world/white-house-suggests-pauses-in-israel-hamas-conflict-to-get-people-out"
            ]
        ]
    },
    {
        "Date": "08 October 2023",
        "Event": "Hamas launched attacks on Israel, described as \"brutal terrorist attacks\" by the EU, marking the start of the current conflict.",
        "Contextual_Annotation": "The EU's condemnation of the attacks highlights the international community's condemnation of Hamas' actions and the widespread recognition of the violence as terrorism.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/eu-leaders-to-hold-emergency-virtual-summit-on-middle-east-on-tuesday-0"
            ]
        ]
    },
    {
        "Date": "10 October 2023",
        "Event": "Israel began a ground offensive in Gaza, following three nights of airstrikes, in response to Hamas's attack. Israeli tanks advanced into the southern fringes of Gaza City and blocked the main highway, while airstrikes continued to target Hamas infrastructure.",
        "Contextual_Annotation": "This marked a significant escalation in the conflict, with Israel expanding its military operations into Gaza to target Hamas and its infrastructure.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ]
        ]
    },
    {
        "Date": "14 October 2023",
        "Event": "European Council President Charles Michel announced a video conference summit of EU leaders to discuss the Israel-Hamas conflict, emphasizing the need for a unified course of action. The UN also called for an immediate humanitarian ceasefire in Gaza, warning that the system for delivering aid was failing to meet the unprecedented humanitarian needs of the population.",
        "Contextual_Annotation": "These events highlight the international community's concern about the escalating conflict and the urgent need for a humanitarian response to address the growing needs in Gaza.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/eu-leaders-to-hold-emergency-virtual-summit-on-middle-east-on-tuesday-0"
            ],
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ]
        ]
    },
    {
        "Date": "15 October 2023",
        "Event": "The EU expressed \"full solidarity\" with the people of Israel and acknowledged Israel's right to defend itself under international law.",
        "Contextual_Annotation": "This statement reiterates the EU's support for Israel's right to self-defense while acknowledging the need to protect civilians and prevent further humanitarian crises.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/eu-leaders-to-hold-emergency-virtual-summit-on-middle-east-on-tuesday-0"
            ]
        ]
    },
    {
        "Date": "17 October 2023",
        "Event": "EU leaders are scheduled to hold an emergency virtual summit to discuss the conflict and its implications.",
        "Contextual_Annotation": "This summit underscores the urgency of the situation and the importance of coordinated international action to address the conflict.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/eu-leaders-to-hold-emergency-virtual-summit-on-middle-east-on-tuesday-0"
            ]
        ]
    },
    {
        "Date": "23 October 2023",
        "Event": "EU foreign ministers hold a meeting in Luxembourg to discuss the ongoing war between Israel and Hamas. Swedish foreign minister Tobias Billstrom states that while discussions on a humanitarian ceasefire are ongoing, the focus should be on finding ways to deliver aid to Palestinians in Gaza. Billstrom emphasizes that this can be achieved through various methods, including a U.N. proposal for a humanitarian corridor. EU foreign policy chief Josep Borrell expresses support for a \"humanitarian pause\" in the conflict. However, some EU foreign ministers voice reservations about this idea.",
        "Contextual_Annotation": "This meeting highlights the growing pressure for a humanitarian pause in the conflict, as concerns rise over the deteriorating humanitarian situation in Gaza.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/asia/eu-continues-talks-on-humanitarian-ceasefire-in-israel-hamas-war"
            ]
        ]
    },
    {
        "Date": "26 October 2023",
        "Event": "President Joe Biden calls for a pause in the conflict to allow for the release of hostages held by Hamas.",
        "Contextual_Annotation": "This call for a pause reflects the growing international pressure on both sides to de-escalate the conflict and address the humanitarian crisis, particularly the fate of hostages.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/white-house-suggests-pauses-in-israel-hamas-conflict-to-get-people-out"
            ]
        ]
    },
    {
        "Date": "27 October 2023",
        "Event": "Israel's army launched 'stage two' of the war with ground incursions into Gaza, following weeks of heavy bombardment. The Palestinian Health Ministry reported over 8,000 deaths in Gaza. Israel launched a heavy bombardment of Gaza in retaliation for the Hamas attack, leading to the deaths of over 7,000 people in Gaza, according to the enclave’s Health Ministry. Arab states drafted a resolution calling for an immediate humanitarian truce in Gaza, which was voted on at an emergency special session of the UN General Assembly. Singapore voted in support of the resolution calling for a humanitarian truce, expressing its condemnation of Hamas’s terrorist attacks and its support for Israel’s right to defend itself. The resolution, which received 121 votes in favour, 44 abstentions, and 14 votes against (including Israel and the United States), calls for all parties to comply with international humanitarian law and protect civilian lives. Singapore announced a financial contribution through the Singapore Red Cross to support humanitarian relief operations in Gaza. Many Singaporeans also made their own contributions to relief efforts.",
        "Contextual_Annotation": "This date marks a significant escalation of the conflict, with Israel launching a ground invasion of Gaza and heavy bombardment resulting in a devastating loss of life. The UN General Assembly vote reflects the international community's call for a humanitarian truce and an end to the violence.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/un-chief-warns-gaza-growing-more-desperate-by-the-hour"
            ],
            [
                "https://www.straitstimes.com/singapore/s-pore-supports-humanitarian-aid-calls-for-civilian-lives-to-be-protected-in-gaza-s-pore-un-ambassador"
            ]
        ]
    },
    {
        "Date": "28 October 2023",
        "Event": "Israel confirmed the death of German-Israeli Shani Louk, who was captured by Hamas during their attack on a desert music festival.",
        "Contextual_Annotation": "This news highlights the human cost of the conflict, with individuals caught in the crossfire and the tragedy of families losing loved ones.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ]
        ]
    },
    {
        "Date": "29 October 2023",
        "Event": "UN Secretary-General Antonio Guterres, on a visit to Nepal, expressed concern about the worsening humanitarian situation in Gaza and called for an immediate ceasefire and humanitarian relief. Internet access was severed in Gaza, but was restored following US pressure on the Israeli government.",
        "Contextual_Annotation": "This underscores the dire humanitarian situation in Gaza and highlights the global community's calls for a ceasefire and the importance of maintaining access to essential services, including communication.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/un-chief-warns-gaza-growing-more-desperate-by-the-hour"
            ],
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ]
        ]
    },
    {
        "Date": "30 October 2023",
        "Event": "Reports emerged of thousands of people ransacking aid warehouses in Gaza due to shortages of basic necessities, such as water and food. The UN reported that 64 of its aid workers had been killed in Gaza since the start of the conflict.",
        "Contextual_Annotation": "These reports highlight the desperate conditions in Gaza, with the lack of basic necessities leading to unrest and the tragic loss of aid workers.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ]
        ]
    },
    {
        "Date": "31 October 2023",
        "Event": "Hamas released a video of three women hostages, urging Netanyahu to agree to a prisoner exchange. Japan's Foreign Minister Yoko Kamikawa embarked on a tour of Israel and Jordan, a visit that coincided with the escalating conflict in Gaza.",
        "Contextual_Annotation": "Hamas's hostage video aimed to pressure Israel into a prisoner exchange, highlighting the human cost of the conflict. Japan's foreign minister's visit to the region aimed to show support for a two-state solution amidst the escalating conflict.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ],
            [
                "https://www.straitstimes.com/asia/japan-to-provide-65-million-additional-humanitarian-aid-to-palestinians"
            ]
        ]
    },
    {
        "Date": "31 October 2023",
        "Event": "Israeli Prime Minister Benjamin Netanyahu rejected calls for a ceasefire, stating that it would amount to surrendering to Hamas. The US also objected to a ceasefire, calling for pauses to allow aid into Gaza instead.",
        "Contextual_Annotation": "This rejection of a ceasefire raises concerns about the potential for further escalation and the continued suffering of the civilian population in Gaza.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/israel-pm-netanyahu-rejects-gaza-ceasefire-says-it-amounts-to-surrendering-to-hamas"
            ]
        ]
    },
    {
        "Date": "02 November 2023",
        "Event": "A crossing to Egypt opened, allowing 79 US citizens to leave the Gaza Strip. The White House announced plans to explore a series of temporary and localized pauses in the conflict to facilitate humanitarian aid and safe evacuations from Gaza. Senator Dick Durbin (Democrat) calls for a ceasefire, while Senator Patty Murray (Democrat) advocates for a humanitarian pause to allow aid access. UN experts urge a humanitarian ceasefire in Gaza, citing the 'grave risk of genocide' facing Palestinians. Israel emphasizes that its attacks target Hamas, not civilians, but acknowledges some civilian casualties. The White House reports that 55 more aid trucks entered Gaza, bringing the total to over 220.",
        "Contextual_Annotation": "Amidst the escalating conflict, the US sought to facilitate humanitarian aid and evacuation of its citizens from Gaza. Calls for a ceasefire and humanitarian pauses emerged from various stakeholders, highlighting the need for civilian protection and aid access. The White House acknowledged some civilian casualties while reiterating its focus on targeting Hamas.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/white-house-suggests-pauses-in-israel-hamas-conflict-to-get-people-out"
            ]
        ]
    },
    {
        "Date": "03 November 2023",
        "Event": "UN aid chief Martin Griffiths calls for humanitarian pauses in Israel's bombardment of Gaza to facilitate aid deliveries. He notes that aid levels are significantly below pre-conflict levels. Palestinian envoy to the United Nations Riyad Mansour calls for a full ceasefire, arguing that saving lives should be prioritized and all hostilities should cease. During her tour, Ms. Kamikawa met with Israeli Foreign Minister Eli Cohen and Palestinian counterpart Riyad al-Maliki, discussing Japan's continued support for a two-state solution. US military officers visited Israel to share insights from past urban conflicts, but have since returned. The White House reiterates its commitment to minimizing civilian casualties in Israel's operations.",
        "Contextual_Annotation": "The UN sought to address the worsening humanitarian situation in Gaza by calling for humanitarian pauses, allowing for aid delivery. The Palestinian envoy urged a full ceasefire, prioritizing the preservation of civilian lives. Japan's continued support for a two-state solution was reiterated during Ms. Kamikawa's tour. The US military shared insights on urban conflicts with Israel, demonstrating its involvement in the situation.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/un-bodies-make-united-call-for-humanitarian-ceasefire-in-gaza"
            ],
            [
                "https://www.straitstimes.com/asia/japan-to-provide-65-million-additional-humanitarian-aid-to-palestinians"
            ],
            [
                "https://www.straitstimes.com/world/white-house-suggests-pauses-in-israel-hamas-conflict-to-get-people-out"
            ]
        ]
    },
    {
        "Date": "04 November 2023",
        "Event": "Japan announced a US$65 million (S$88 million)  humanitarian aid package for Palestinians, expressing concern over the ongoing conflict in Gaza. Japan indicated plans to provide material aid to the war-torn Gaza region, highlighting the need for peaceful coexistence between Israel and Palestine. Japan's Foreign Minister refrained from commenting on the legality of Israel's strikes on Gaza but emphasized the importance of protecting human rights and minimizing civilian casualties. Japan is scheduled to host the foreign ministers of the Group of Seven nations in Tokyo, amidst the deepening crisis in Gaza, with Israel facing pressure for a humanitarian pause. The conflict in Gaza escalates, with Israel resisting calls for a humanitarian pause and Hezbollah leader warning of potential spillover into neighboring areas.",
        "Contextual_Annotation": "Japan announced a significant humanitarian aid package for Palestinians, highlighting its concern for the escalating conflict and emphasizing the need for peaceful coexistence between Israel and Palestine. Despite the deepening crisis, Japan refrained from directly commenting on the legality of Israel's actions, prioritizing human rights and civilian protection. The conflict continued to escalate, with Israel resisting calls for a humanitarian pause and the risk of regional spillover.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/asia/japan-to-provide-65-million-additional-humanitarian-aid-to-palestinians"
            ]
        ]
    },
    {
        "Date": "06 November 2023",
        "Event": "Heads of major UN bodies issue a joint statement calling for a humanitarian ceasefire in Gaza. They express concern over the deteriorating humanitarian situation and call for an end to the violence. This signifies the international community's growing concern and pressure for a ceasefire.",
        "Contextual_Annotation": "The international community, through the UN, issued a joint statement calling for a humanitarian ceasefire in Gaza, demonstrating their growing concern about the deteriorating humanitarian situation and mounting pressure for an end to the violence.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/un-bodies-make-united-call-for-humanitarian-ceasefire-in-gaza"
            ]
        ]
    },
    {
        "Date": "19 November 2023",
        "Event": "Iran-backed Houthis seized the Galaxy Leader commercial ship and its crew, posing a threat to international shipping lanes and commercial vessels.",
        "Contextual_Annotation": "The Houthis' seizure of the commercial ship posed a significant threat to international shipping and commercial activities, adding to regional tensions and concerns over maritime security.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/g7-foreign-ministers-support-extension-of-pause-in-fighting-in-gaza"
            ]
        ]
    },
    {
        "Date": "23 November 2023",
        "Event": "A four-day ceasefire agreement went into effect, brokered by Egypt, Qatar, and the United States, in an attempt to de-escalate the conflict. The release of 58 hostages began in three phases, with more expected to be freed on Monday (November 27th), out of the 184 still held in Gaza.",
        "Contextual_Annotation": "A four-day ceasefire agreement, brokered by international mediators, provided a temporary respite from the conflict and initiated the process of releasing hostages, offering a glimmer of hope for de-escalation and potential resolution.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/gazans-call-for-truce-to-be-extended-israelis-divided-on-the-issue"
            ]
        ]
    },
    {
        "Date": "24 November 2023",
        "Event": "A six-day truce between Hamas and Israel began, providing a respite from seven weeks of Israeli bombardment in Gaza.",
        "Contextual_Annotation": "The six-day truce provided a much-needed respite for Gazans from the intense bombardment, allowing for humanitarian aid and recovery efforts.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/g7-foreign-ministers-support-extension-of-pause-in-fighting-in-gaza"
            ]
        ]
    },
    {
        "Date": "27 November 2023",
        "Event": "Gazans expressed their desire for the truce to be extended, highlighting the hardships they faced due to the conflict, including displacement, lack of food and water, and power outages. Israelis were divided over the potential extension of the truce, with some advocating for its continuation to secure the release of all hostages, while others argued against it, believing it was too favorable to Hamas. Negotiators from Egypt, Qatar, and the United States were engaged in efforts to persuade Hamas and Israel to reach an agreement to extend the truce.",
        "Contextual_Annotation": "As the truce neared its end, the desire for its extension was evident among Gazans, who faced significant hardship due to the conflict. Meanwhile, Israelis remained divided on the truce's extension, reflecting the complexities of the conflict and the challenges of finding a lasting solution.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/gazans-call-for-truce-to-be-extended-israelis-divided-on-the-issue"
            ]
        ]
    },
    {
        "Date": "28 November 2023",
        "Event": "G-7 foreign ministers issued a joint statement expressing their support for an extension of the current pause in fighting in Gaza and future pauses. They also called for the unconditional release of all hostages and emphasized Israel's right to self-defense while stressing the importance of civilian protection and compliance with international law. Hamas released 12 more hostages, bringing the total number of released hostages to 81 since the truce began. Israel released 30 Palestinian prisoners.",
        "Contextual_Annotation": "The G-7, in a joint statement, voiced their support for extending the ceasefire in Gaza, emphasizing the need for civilian protection and adherence to international law. The exchange of hostages continued, offering a glimmer of hope for a lasting resolution to the conflict.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/g7-foreign-ministers-support-extension-of-pause-in-fighting-in-gaza"
            ]
        ]
    },
    {
        "Date": "29 November 2023",
        "Event": "The G-7 foreign ministers urged the Houthis to cease threats to international shipping lanes and commercial vessels and to release the Galaxy Leader commercial ship and its crew.",
        "Contextual_Annotation": "The G-7 condemned the Houthis' actions, calling for the release of the commercial ship and its crew and highlighting the threat posed to international shipping lanes and maritime security.",
        "Article_URL": [
            [
                "https://www.straitstimes.com/world/middle-east/g7-foreign-ministers-support-extension-of-pause-in-fighting-in-gaza"
            ]
        ]
    }
]